[
  {
    "title": "RSNO Viennese Gala",
    "description": "Vienna – the city where the concert halls are golden and the music sparkles! It simply wouldn’t be New Year without the music of Vienna’s most famous son Johann Strauss and his friends. Let us whirl you away to a world full of elegant waltzes, playful polkas and good old-fashioned romance, presented by Scottish tenor Jamie MacDougall and led from the podium by Conductor Derrick Morgan. Filled with tunes you’ll know and love, get your 2026 off to a glittering start with this concert featuring the wonderful musicians of the Royal Scottish National Orchestra.",
    "date_start": "2026-01-18T15:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/523869/Viennese_Gala_25_26-1920x1080px_e41b1fc38f40fc2da3c0519111bcf629.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=193E90E5-555A-464C-9BE8-71D821F24558&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Classical",
    "raw_showtimes": [
      "Sun 18 Jan at 3:00"
    ]
  },
  {
    "title": "Carlos Acosta’s Nutcracker in Havana",
    "description": "Carlos Acosta’s Nutcracker in Havana, is back by popular demand, following a hugely successful premiere sell-out tour. A Cuban take on the favourite festive classic, the production explodes onto the stage, featuring new choreography by Carlos Acosta CBE and performed by more than 20 dancers from his Cuban company, Acosta Danza.\n\nSet to an exuberant Cuban newly commissioned version of the magnificent Tchaikovsky score, arranged by Cuban composer Pepe Gavilondo, the timeless story is brought to life with ballet at its core, enriched with Acosta Danza’s unique style and with Cuban dance traditions beautifully woven throughout the much-loved and joyful family tale.\n\nJoin Clara in her humble home in Havana, getting ready to celebrate Christmas with her family. The beer cans are on the tree and Cuba is suitably hot. When Clara is gifted a Nutcracker doll she embarks on the journey of a lifetime, to defeat the Rat King and into the world of the Sugar Plum Fairy accompanied by her Nutcracker Prince.\n\nWith spectacular video projection and set design by Nina Dunn (9to5 Musical, Bonnie and Clyde, BRB’s Don Quixote), Cuba collides with the Land of Sweets, bringing snow to Havana. With lighting by Andrew Exeter (Oti Mabuse: I Am Here, The Full Monty UK Tour, Johannes Radebe: House of JoJo) and costumes by Angelo Alberto (costume designer for Goyo Montero’s ‘Imponderable’ and Raul Reinoso’s ‘Satori’ with Acosta Danza) Nutcracker in Havana is a visually stunning spectacular treat for all.\n\nFor dance fans around the globe, Carlos is an international superstar of the classical ballet world. Born in Havana and trained at the National School of Ballet in Cuba, he went on to dance professionally with the world’s most prestigious companies, with London’s Royal Ballet becoming his home. Having tackled huge titles throughout his career, from Carmen to Don Quixote, Nutcracker in Havana is an opportunity for Acosta to fuse this festive treat with a little Havana heat.",
    "date_start": "2026-01-20T19:30:00+00:00",
    "date_end": "2026-01-21T19:30:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/502687/NIH-Inverness-Web-image_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=902BFD5B-AB18-46A8-8DF0-BCA880CDDCD2&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Dance",
    "raw_showtimes": [
      "Tue 20 Jan at 7:30",
      "Wed 21 Jan at 2:30",
      "Wed 21 Jan at 7:30"
    ]
  },
  {
    "title": "Connor Burns: Gallus",
    "description": "GALLUS is Connor’s fourth solo hour. A prolific joke writer whose lightning fast, razor-sharp wit combines with his signature single malt Scottish-level cynicism to help create the perfect storm of brilliant jokes performed by a disarming comedy powerhouse and, now more recently, has seen Connor become a social media star.\n\nConnor’s previous smash-hit show \"1994\" sold 10,000+ tickets in Edinburgh, sold out 2 solo Glasgow King’s Theatre dates and toured worldwide. Winner of the prestigious international Fringe Encore Series in both 2025 and 2024, Connor has supported Daniel Sloss in 3 continents and filmed his debut special “Vertigo”, for world-wide release on the prestigious 800LB Gorilla comedy label.\n\nA show for anyone who loves live stand-up, make sure you check out this fantastic comedian and budding superstar early days – book now!\n\n*Gallus: Traditional Scots dialect meaning bold, daring and reckless.",
    "date_start": "2026-01-20T20:00:00+00:00",
    "date_end": "2026-01-23T20:00:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/518951/2025-Connor-Burns-SOCIALS-ADMAT-1440x580_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=086D10D3-C197-47E9-9997-252D15342CCC&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Tue 20 Jan at 8:00",
      "Wed 21 Jan at 8:00",
      "Thu 22 Jan at 8:00",
      "Fri 23 Jan at 8:00"
    ]
  },
  {
    "title": "Hamza Yassin – My Life Behind The Lens",
    "description": "Join wildlife cameraman and presenter Hamza Yassin on a new adventure as he takes to the stage for his first nationwide theatre tour My Life Behind the Lens. Hamza will share his infectious sense of wonder and most precious memories both in life and in nature.\n\nMy Life Behind the Lens promises to be an unforgettable show filled with adventure, storytelling, and stunning wonders from the natural world.\n\nHamza brings a fresh perspective to the natural world, and he truly believes that by engaging people in the joy of Mother Nature and what she has to offer, we can all gain a fresh perspective on the world around us and how we can protect it together.\n\nHamza shares behind the scenes tales from his epic filming expeditions across the globe. Packed with breathtaking footage, fascinating insights, charming personal stories, and with a deep passion for nature, he invites audiences of all ages to reconnect with the wild world around them. This unique live experience offers a rare glimpse into the life and work of one of Britain’s most beloved natural history storytellers.",
    "date_start": "2026-01-24T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/513373/Hamza-Yassin-Image_ada2ab928ba714897ee18452bb1a00a0.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=E3A3ED5A-2DD8-4063-8164-B7D1F07C23F1&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Talks / Special Events",
    "raw_showtimes": [
      "Sat 24 Jan at 7:30"
    ]
  },
  {
    "title": "Craig Hill: Wait ‘Til You See My Entrance!",
    "description": "Don’t miss Scotland’s cheeky, irreverent and uproarious Kilty Comedy Pleasure and join Craig as his hilarious new live tour explodes onto the Eden Court stage for a kilt swingin', laugh-out-loud, highland fling of a fun evening oot!\n\nThere’s no more waiting in the wings as Craig reveals what's behind the curtain – a high-octane brilliant night out with his unique blend of stand-up comedy, music, dancing…..and everything in between.\n\nRenowned for his razor-sharp wit and unsurpassed audience rapport, Craig has performed across Europe, Australia (including Sydney’s Opera House), Scotland as well as south of the border including London Palladium, off-Broadway in New York and even a bespoke Variety show created for Lord Lloyd Webber on his estate.\n\nThree-time nominee for the Sir Billy Connolly Spirit of Glasgow Award, Craig’s adrenaline-rush packed shows are hugely popular for a good reason - get ready for an outrageously fun night of fantastic laughs. Book early!",
    "date_start": "2026-01-24T20:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/515895/2025-Craig-Hill.-Photo-by-Steve-Ullathorne.LANDSCAPE.MAIN_ffe56838374c7a75583e3d9da391c5f5.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=887C6A8E-4F7A-48D8-A806-7D9E69B095C8&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 24 Jan at 8:00"
    ]
  },
  {
    "title": "The Snow Queen",
    "description": "SCOTTISH BALLET: The Snow Queen\n\nChoreography: Christopher Hampson CBE\n\nMusic: Nikolay Rimsky-Korsakov\n\nScottish Ballet’s spectacular and much-loved production of The Snow Queen returns to the stage, after its hugely popular tour in 2022.\n\nThis glittering production is inspired by Hans Christian Andersen’s classic tale – which was also the basis for Frozen. Set to the music of Rimsky-Korsakov which will be performed live by the full Scottish Ballet Orchestra.\n\nFrom the bustle of a winter’s market to the shivers of a fairy tale forest, take a journey to the Snow Queen’s palace, where you’ll find her surrounded by the icy fragments of an enchanted mirror. Along the way you’ll meet a colourful cast of characters, from young lovers parted by a spell to a circus ringmaster with a few tricks up his sleeve.\n\nChoreographed by Christopher Hampson and designed by the award-winning Lez Brotherston, this story of love and friendship is sure to delight the whole family.\n\nTouch Tour - They are behind the scenes tours in order for visually impaired patrons to walk on the set, feel costumes and props, and get an account of where these things appear in the show, and their relevance to the story. Tours are free of charge but are specifically for visually impaired patrons and their companions.",
    "date_start": "2026-01-28T19:30:00+00:00",
    "date_end": "2026-01-31T19:30:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/478537/The-Snow-Queen-snip_afd1853ac727aaf5a35b1cd350d6e4e4.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=4C4B480C-C288-425A-9056-E897828AFE2A&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Talks / Special Events",
    "raw_showtimes": [
      "Wed 28 Jan at 7:30",
      "Thu 29 Jan at 2:30",
      "Thu 29 Jan at 7:30",
      "Fri 30 Jan at 6:30",
      "Fri 30 Jan at 7:30",
      "Sat 31 Jan at 1:00",
      "Sat 31 Jan at 2:30",
      "Sat 31 Jan at 7:30"
    ]
  },
  {
    "title": "Mark Black – Horrible Family",
    "description": "Mark Black’s brings you his brand-new stand-up comedy & musical show ‘Horrible Family’. Having amassed millions of views online, as well as sold out shows at the SEC Armadillo and Pavilion theatre in 2024, Mark is back with his dark wit and an array new songs for 2026.",
    "date_start": "2026-01-31T20:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/516925/Mark-Black-Horrible-Family_afd1853ac727aaf5a35b1cd350d6e4e4.jpeg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=1E884D42-19FA-4296-8F5D-1B468C586381&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 31 Jan at 8:00"
    ]
  },
  {
    "title": "Money For Nothing Dire Straits Tribute",
    "description": "Money for Nothing are back after their success last year. Celebrating 25 years of performing their tribute to legendary rockers Dire Straits.\n\nHaving toured the world with their fully-live two-hour show and tipped as the world’s number one Dire Straits tribute, join them for a night of classic Dire Straits hits including versions from the ‘Alchemy’, ‘Brothers in Arms’ and ‘On Every Street’ tours. You will be blown away with the attention to detail and musicality whilst taking a trip down memory lane.\n\nA must for any rock enthusiast or Dire Straits fan.",
    "date_start": "2026-02-04T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/518635/Facebook-banner-1_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=61766FA9-0B05-4006-A142-E449088D8C13&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 4 Feb at 7:30"
    ]
  },
  {
    "title": "LEO HOULDING: EXPOSED",
    "description": "Join legendary climber Leo Houlding for his next new show, Exposed, a gripping live experience with stunning visuals, film, and storytelling from the world’s wildest places. After three decades on the edge of adventure, Leo now explores with his young family—kiting across the Norwegian Arctic, canyoning in the Arabian desert, paddling remote Pacific islands, and spending a week vertical camping with the kids up El Capitan.\n\nA story of risk, resilience, and reward—Exposed will inspire you to embrace discomfort, confront fear, and chase your own horizons.",
    "date_start": "2026-02-04T20:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/522443/LH-EXPOSED-IMAGE_01d3cffb1e6bac2d9e12f674b864cc15.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=157454FF-8FAC-41FF-A24A-76A4883F854C&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Talks / Special Events",
    "raw_showtimes": [
      "Wed 4 Feb at 8:00"
    ]
  },
  {
    "title": "The Magic of the Bee Gees",
    "description": "Direct from London’s West End. . .\n\nWhether you’re a brother or whether you’re a mother, when the feeling's gone and you can't go on,\n\nit’s time to put on your dancing shoes, for the night out of the year you have been waiting for, as we celebrate the songs of music royalty, the Bee Gees.\n\nComplete with stunning light and video show, prepare to experience the distinct sound of one the greatest bands to have ever graced the stage in this unforgettable concert spectacular.\n\nImmerse yourself in the brothers’ music through the Sixties, Seventies, and Eighties – including hits they wrote for artists such as Celine Dion, Diana Ross, and Dolly Parton.\n\nJoin us for this breath-taking concert spectacular, taking you on a musical journey through all your favourite songs, including Night Fever, Stayin’ Alive, More Than a Woman, You Should Be Dancing, How Deep is Your Love and many more!\n\nThis fabulously authentic production ensures the Gibb brothers’ incredible legacy of classic hit songs is well and truly stayin’ alive!\n\nThis is a tribute show and is no way affiliated with any original artists/estates/management companies or similar shows.\n\nPromoter reserves the right to alter the programme.",
    "date_start": "2026-02-05T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/523873/TheMagicOfTheBeeGees-1920x1080_c0fe387310d35b87a12f3039f53da6da.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=82F77C56-14E4-4B11-84E7-C107798B2E90&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 5 Feb at 7:30"
    ]
  },
  {
    "title": "Girls Night Oot 2! Heartbreaks and Promises",
    "description": "FROM THE PRODUCERS THAT BROUGHT YOU THE SMASH HIT SHOW\n\nGIRLS’ NIGHT OOT!\n\nINSIDEOUT THEATRE PRODUCTIONS LTD\n\nPROUDLY PRESENT\n\nTHE SENSATIONAL SEQUEL\n\nGIRLS’ NIGHT OOT! 2 HEARTBREAKS AND PROMISES\n\nA musical comedy\n\nThe ladies are back for a night full of song and laughter to help mend a broken heart, then it is off to the dancing to dance the night away!\n\nTo survive a heartbreak all a lassie needs are her pals. Book now for this hilarious new musical comedy.\n\nMusic from the 60’s, 70’s, 80’s, 90’s and noughties.\n\nStarring Donna Hazelton, Natalie Tulloch, Pamela Byrne, Sarah Galbraith\n\nWritten and directed by Paul Harper-Swan\n\nCOMING TO A THEATRE NEAR YOU!\n\n*Cast subject to change",
    "date_start": "2026-02-06T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/525921/GNO2-Wide-image_5a6fd6b50c0f36b2b706f1f517743d56.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=18E263D1-1A15-4D06-94D2-CE9A0D3A64F8&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 6 Feb at 7:30"
    ]
  },
  {
    "title": "Cocktails and Cabaret",
    "description": "Calling all queens... Scarlet Diamonte is back with another glittery, stiletto-sharp exDRAGaganza!\n\nScarlet will have you giggling and singing your way through cabaret and cocktails. Enjoy a tipple on arrival, naughty entertainment and a guaranteed mood boost.\n\nSo get glammed up, grab your pals and get ready for a fabulous night out!",
    "date_start": "2026-02-06T19:30:00+00:00",
    "date_end": "2026-02-07T19:30:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/537181/COCKTAILS-AND-CABARET-Scarlet-Diamonte-1-Credit-Michael-Carver_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/seatSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=0F490758-E2A1-4389-8283-1EF8A4C4C54F&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Talks / Special Events",
    "raw_showtimes": [
      "Fri 6 Feb at 7:30",
      "Sat 7 Feb at 7:30"
    ]
  },
  {
    "title": "The Little Wander Comedy Gala",
    "description": "Little Wander, in association with Eden Court, showcase an unforgettable evening of comedy in Inverness hosted by the wonderful Christopher MacArthur Boyd (as seen on BBC's Frankie Boyle's New World Order) and featuring Taskmaster’s Phil Ellis and Jamali Maddix!\n\nWith a fabulous line-up of famous faces and emerging talent, including Glasgow’s ‘rising Scottish star’ (The List) Christopher Macarthur-Boyd, Funny Women Stage Award Finalist Sharon Wanjohi (Comedy Central Live), Geordie gem Louise Young (Channel 4, Comedy Central), the amazing Michael Odewale (Live at The Apollo, Cunk on Earth), Jamali Maddix (Never Mind the Buzzcocks) and Phil Ellis (Taskmaster, BBC Radio 4), bringing you a performance ‘touched by comic genius’ (Scotsman).\n\nBrought to you by Little Wander, the team behind the iconic Machynlleth Comedy Festival and tours from James Acaster, Bridget Christie, Three Bean Salad podcast and more.\n\nLine up subject to change.",
    "date_start": "2026-02-07T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/571719/Ticket-Page_62b0b63254f709dbb19617a1cf1d90dc.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=9BFD94CD-EBEE-49CA-8082-F7FF08035FAF&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 7 Feb at 7:30"
    ]
  },
  {
    "title": "An Evening with Jeff Stelling hosted by Bianca Westwood",
    "description": "Get ready for a night of football, fun, and fabulous stories! We invite you to an unforgettable evening with the iconic Jeff Stelling, the legendary anchor of Sky Sports Gillette Soccer Saturday, who has been the face of football Saturdays for over 30 years.\n\nThis is no ordinary evening—Jeff will bring his trademark charm and wit as he regales you with behind-the-scenes tales, hilarious anecdotes, and stories about his journey to becoming the voice of football weekends. Over the years, he’s rubbed shoulders with football royalty, from George Best to David Beckham and Roy Keane, and now, you’ll hear about it all first-hand.\n\nAdding even more energy to the event, Sky Sports’ own Bianca Westwood will step up to host and give Jeff a playful “roast” on stage. Expect plenty of laughs and surprises!\n\nBut Jeff’s impact goes far beyond the world of football. As an ambassador for Prostate Cancer UK, he has led 34 marathon walks across the UK which hold raw and real tales he will bring to the stage. Jeff’s passion for making a difference has earned him an MBE, a testament to his incredible contributions both on and off the pitch.\n\nNot only will you enjoy Jeff’s stories, but there’s also an exclusive audience Q&A, where you can ask him your burning questions, and a chance to create some remarkable sporting memories.\n\nFor those who want an extra-special experience, VIP tickets are up for grabs, offering a meet-and-greet with Jeff himself. But hurry—these are limited.\n\nFootball fans, mark your calendars and book now—this promises to be an evening you’ll be talking about long after the final whistle.",
    "date_start": "2026-02-11T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/522019/1200-x-565-Main-Show-Image-1_8a50371aa79f1bbb32236c2d4f8a9117.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=65A1A4EF-5242-45F3-BD14-8AADCBDFF6EB&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Talks / Special Events",
    "raw_showtimes": [
      "Wed 11 Feb at 7:30"
    ]
  },
  {
    "title": "The Ultimate Boyband Party Show",
    "description": "ONE EPIC NIGHT - ALL THE HITS - TOTAL 90s NOSTALGIA!\n\nBoybands are back…. ALRIGHT! Bigger, bolder, and with more Boyband hits than ever before!\n\nAfter two sell-out UK tours and rave reviews, the boys are ready to serve up slick moves, dreamy harmonies, and all the swoon-worthy charisma you crushed on back in the day.\n\nExpect poptastic hits from: Take That • Boyzone • Westlife • NSYNC • Blue • 5IVE • Backstreet Boys - and loads more!\n\nSo, what you waiting for - grab ya girls and get ready for a concert experience you’ll ‘Never Forget’! This is the night to sing, scream, and dance like it’s 1999.\n\nWarning: May include cheesy dance breaks, slow-mo hair flicks, and spontaneous group singalongs. You’ve been warned!\n\nDisclaimer: The Ultimate Boy Band Party Show is a tribute show celebrating the music of the very best boy bands of the 90s.",
    "date_start": "2026-02-12T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/506497/The-Ultimate-Boyband-Party-Show_97ad865a02989ba785009719837e605f.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=371A561C-2C61-4EB9-9317-EADB807C1E12&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 12 Feb at 7:30"
    ]
  },
  {
    "title": "Heidi Talbot",
    "description": "Heidi Talbot was born in Ireland became a folk star in the USA as a member of the Irish American band Cherish the Ladies, and now lives in Edinburgh, Scotland. From her gossamer voice to the delicate re-working of traditional and contemporary material that has earned her rave reviews for her records and Live performances, the girl from Co. Kildare, who spent several years in New York, slips effortlessly between musical worlds but retains a personal modesty rooted in traditional folk.\n\nOver the past twenty years Heidi has performed all over North and South America, the United Kingdom, Ireland, Europe, Scandinavia, Japan, Australia and New Zealand performing in the finest Concert Halls and International Festivals. She is equally at home in front of a Symphony Orchestra, a Performing Arts Center, a Folk Festival or even at the White House.\n\nShe has shared the stage and recorded with Mark Knopfler, Graham Coxon(Blur), Eddi Reader, Idlewild, Matt Rollings, King Creosote, Kris Drever, Tim O'Brien and Jerry Douglas.\n\nHeidi recorded four solo albums while signed to Nashville based record label Compass Records. In the last 6 years she has recorded four more solo albums/Ep’s self released and distributed by Universal Records including the critically acclaimed, Sing It For A Lifetime.\n\nNominated for Folk singer of the year and Best Traditional Song by BBC Radio 2, Best Live Act by the Scottish Traditional Music Awards and Best Female Vocalist at The Irish Music Awards. 2023 saw Heidi win Composer of The Year at the Scots Trad Music Awards.\n\nIn October 2025, Heidi releases her 9th studio album, Grace Untold.",
    "date_start": "2026-02-13T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/525995/Heidi-Talbot-1_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=18ACB469-233B-49BF-AB19-D550EC8D4118&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 13 Feb at 7:30"
    ]
  },
  {
    "title": "Stuart Mitchell: Tips Not Included",
    "description": "Stuart Mitchell is now regarded as one of the UK’s top comedians and social media stars with over a 100M views online. You've seen him online and now you can see him on his first ever national UK tour, Tips Not Included. Join the longest running panellist of BBC Scotland’ Breaking The News as he shares his amazing life story. \"Please go and see Stuart Mitchell\" Will Ferrell.",
    "date_start": "2026-02-13T20:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/479185/Stuart-Mitchell-Main-Image_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=D3FAC75E-0391-41D4-8A3A-3D586FE6FF81&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 13 Feb at 8:00"
    ]
  },
  {
    "title": "The Brandon McPhee Show",
    "description": "At the age of 17 Brandon won the All Scottish accordion championship, the first time in almost 30 years a button key accordion won this competition. After spending a number of years honing his craft in music, not only has his accordion earned him professional status but also his vocals. Brandon still a young man. From accolades in the Scottish Parliament to Royal audiences, including performances for The King, Brandon's impact resonated far and wide, his performances for, international dignitaries including Margot Robbie and James Nesbitt also at esteemed institution Oxford and Cambridge University for an anniversary Scottish Country Dance and thousands of supporters who already support Brandon at his concerts and theatre shows. He has recorded duets with Daniel O' Donnell, superstars Foster and Allen, Tony Allen and has shared the stage with them. As well as Gene Watson, Van Morrison, Radney Foster plus many more.\n\nBrandon McPhee's Award-Winning Show is a spectacular celebration to the greats of Country/Scottish music and more, showcasing his virtuoso accordion skills, heartfelt vocals, & captivating stage presence.\n\nThe recent theatre tour of Scotland and Ireland featured many standing ovations and here are some quotes of what the audience said:\n\n* Joan Herald - Congratulations Brandon, You are a talented young man. You have a tremendous pitch perfect voice. Also an amazing accordian player, with a fantastic rapore with your audience.\n\n* Isabella Menzies - This voice is amazing.\n\n* Cynthia Simmons - Fantastic evening at Langholm, the show was great as usual Brandon and well worth our long trip up from Norfolk. Hope to see you our way again soon. Take care all.\n\n* Jess Morrison - You were absolutely fantastic accordion playing was amazing and your singing voice blew me away, Wow, a great night, thank you. x\n\n* Sylvia Douglas - Brandon McPhee thank you for the fabulous night the accordion was something to enjoy so so good and your singing was magic.love all the music was a fantastic night not to forget.god bless hope to see you again soon.\n\n* Rhoda Macdonald - It was a fantastic show Brandon. Well worth my trip up from Dunoon and a chance to visit all my sisters and Wendy. Looking forward to the next trip. * Evelyn Mcmillen - I was at the Antrim last night.....the show was amazing. the band were terrific..the Star of the night Brandon McPhee has matured and is the best. A true entertainer. Very, very talented young man..\n\n* Bernie Crossan - Brandon, you were brilliant in Ballybofey last night a talented accordion player and a beautiful voice, good luck Brandon with the tour hope to see you again in the future.\n\n*** Over 1000 similar comments about the show.",
    "date_start": "2026-02-14T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/513835/Eden-Court_997798207bbe2f5050fc03208babfb30.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=9514426B-EA3D-44E7-AC19-5B21FB13BD18&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sat 14 Feb at 7:30"
    ]
  },
  {
    "title": "Legally Blonde The Musical JR",
    "description": "Say hello to The TFX Show Company—the newest creative force from TFX Performing Arts Academy!\n\nThis high-energy debut production marks the first performance from TFX’s brand new Show Company, a dynamic performance troupe built for students aged 9+ who love to sing, act, and dance. More than just a class, this is a bold new stage for Inverness’s most passionate young performers to shine.\n\nLed by an experienced creative team of industry professionals, the TFX Show Company provides triple-threat training in preparation for an epic annual production—this year’s? The iconic, feel-good powerhouse Legally Blonde: The Musical Jr.\n\nExpect big laughs, bold performances, and boundless energy as these rising stars take on Elle Woods' story of heart, hustle, and heels—with a whole lot of pink!\n\nDon’t miss this empowering, hilarious, and delightfully sassy debut from a company destined to make its mark.",
    "date_start": "2026-02-15T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/526025/Legally-Blonde-JR_b9132b58712153bb9a325b169a374b6a.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=05698335-7157-44A6-A426-D2B25F6A9B83&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Local / Showcase",
    "raw_showtimes": [
      "Sun 15 Feb at 7:30"
    ]
  },
  {
    "title": "Macbeth",
    "description": "Flabbergast’s Macbeth fuses a rigorous and respectful approach to text and storytelling to bring a magical, lucid interpretation of Shakespeare’s blood-soaked tragedy to life.\n\nPuppetry, clown, ensemble, physical theatre, and exhilarating live music, combine in a powerful and provocative interpretation. A stripped back set, an aesthetically arresting design, and a tightknit ensemble of actors, this performance is a dark and visceral manifestation of the work’s essence and underlaying themes, drawing out the parallels with modern society.\n\nThe dominant recurring theme and fundamental narrative that powers The Tragedy of Macbeth is the masculine fear of feminine power; and in this sense, the play is as pertinent today as it has ever been.\n\nFlabbergast’s Shakespeare is for everyone, a visceral and eloquent retelling of Shakespeare’s imbrued tale of vicissitude.",
    "date_start": "2026-02-17T19:00:00+00:00",
    "date_end": "2026-02-18T19:00:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/522001/Michael-Lynch-17_5a8c99943a2520329e2f8da210c11622.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=CF594541-F59F-41B6-98FD-7195702282EB&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Drama",
    "raw_showtimes": [
      "Tue 17 Feb at 7:00",
      "Wed 18 Feb at 7:00"
    ]
  },
  {
    "title": "Hello Again - The Neil Diamond Songbook",
    "description": "The Neil Diamond Songbook | 60 Diamond Years Tour\n\nIn December 1965, Neil Diamond signed a recording contract with Bang Records - and MUSIC was changed forever.Celebrating 60 Diamond Years, the smash hit show HELLO AGAIN is back in 2025 with a brand-new, mind-blowing production – it’s the world’s greatest celebration and tribute to the life and work of NEIL DIAMOND.Now in its nineth triumphant year, this spellbinding experience stars the The Salvation Band and Diaz Sisters.Follow Neil Diamond’s story from his early songwriting days to international stardom through six decades of all your favourite hits, including Sweet Caroline, Cracklin’ Rosie, Forever in Blue Jeans, I am I said, Song Sung Blue, Hello Again, Love on the Rocks, Red, Red Wine, I’m a Believer, America and many, many, more.Featuring evocative imagery, video and narration alongside a supremely talented cast, don’t miss your chance to experience the show regarded as the most successful independent production of its kind...",
    "date_start": "2026-02-17T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/556613/Alternative_Chris-Smile_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=06660186-5954-4526-B1FF-6CDB90F89A5D&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Tue 17 Feb at 7:30"
    ]
  },
  {
    "title": "Michael McGoldrick, John McCusker and John Doyle",
    "description": "Key members of celebrated folk collective Transatlantic Sessions and legends in their own right, Michael McGoldrick, John McCusker and John Doyle are on the road again in 2026, bringing you their own blend of top-class folk songs, tunes and charming bonhomie.\n\nAll three musicians have won global acclaim: Mike McGoldrick is a master of flutes, whistles and Uillean pipes, a renowned composer and current member of Capercaillie. Formerly of Battlefield Band, John McCusker’s unique fiddle playing has earned him a worldwide reputation as one of the most gifted and versatile musicians of any genre. Guitarist and singer-songwriter John Doyle is an Irish music linchpin and founding member of acclaimed group Solas. They have shared stages and recording studios with everyone from Bob Dylan and Mark Knopfler to Paul Weller, Joan Baez and Linda Thompson. With their vast repertoire Mike, John & John are a rare musical treat you’ll savour for a very long time.",
    "date_start": "2026-02-19T20:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/517089/McGoldrick-McCusker-and-Doyle_ea4c47094fe14593ebb826ddf5a03a05.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=F61F6305-ECF8-4580-AE4C-18710EEF0585&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 19 Feb at 8:00"
    ]
  },
  {
    "title": "Kings of the Blues",
    "description": "We are very pleased to welcome back Main Street Blues to Eden Court’s One Touch Theatre with their highly acclaimed “Kings of the Blues” tribute show. Celebrating the life and music of the three great blues masters: BB King, Albert King and Freddie King, the show combines many of the three Kings classics over their long and successful careers, including songs such as Hideaway, Thrill Is Gone, Born Under A Bad Sign, Let The Good Times Roll, Oh Pretty Woman, Some Other Day Some Other Time, Eyesight to the Blind, See See Baby and many, many more. Main Street Blues are no strangers to Eden Court, having performed in the One Touch theatre on many occasions. The band always provided a highly entertaining show and their previous performances of their Kings tribute show received great reviews from the Press & Journal, Edinburgh Jazz & Blues Festival and the Edinburgh Fringe (2019 – 2024)",
    "date_start": "2026-02-20T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/382263/Main-Street-Blues-2024-Eden-Court_37cb80d72a119b38c038a39a69ff8c87.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=4812226E-FCF1-4D16-A758-D450A92C3429&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 20 Feb at 7:30"
    ]
  },
  {
    "title": "Lets PARTY!",
    "description": "Pupils from Cairngorm School of Dance showcase their talents in their full theatre production on the empire stage. The talented young performers dance their way through different parties, and through a variety of dance styles. So .......Let's PARTY!",
    "date_start": "2026-02-21T16:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/525931/Lets-Party_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=A0A278F7-7C86-421C-A7E8-99E2287E2A86&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Local / Showcase",
    "raw_showtimes": [
      "Sat 21 Feb at 4:00"
    ]
  },
  {
    "title": "Ray Bradshaw: CODA",
    "description": "1 in 6 adults in the UK will lose their hearing in their lifetime; two of those are Ray Bradshaw’s parents. The multi award winning comedian is back on tour with a brand-new show all about growing up as a CODA; A Child of Deaf Adults. His upbringing was nothing like the Oscar winning film and he’s here to tell you why.\n\nCODA is a funny, heartwarming show all about the brilliant things that happen when you grow up in a house where sign language is the first language used; whether it’s watching his dad shut his eyes to win any argument or beating his in-laws easily when they suggested playing charades against a deaf family on Christmas Day.\n\nRay’s previous shows Deaf Com One and Doppelginger were huge successes and sold-out theatres across the world. As this show is all about growing up with deaf parents every show of CODA will have a BSL interpreter. Ray has previously supported John Bishop on his UK arena tour after John described him as ‘one of the best comedians in the country’.\n\nSigned- British Sign Language interpretation of the spoken and artistic content.",
    "date_start": "2026-02-21T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/505119/RayBradshawCODA_7fd02740520604141c89db9860d8dfad.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=FE7CBDF5-685F-464C-A68D-CF18629C989B&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 21 Feb at 7:30"
    ]
  },
  {
    "title": "MÁM",
    "description": "MÁM is international dance-theatre at its finest. Described as ‘80 minutes of ritualised ecstasy’ by The Irish Times, this visionary piece playfully and provocatively takes you on an otherworldly journey steeped in the landscape and culture of West Kerry in Ireland.\n\nMÁM sees 12 fearless dancers summon a whirlwind of myth and magic, moved by the collaborative music making of virtuoso Irish traditional concertina player Cormac Begley and European classical contemporary collective s t a r g a z e, performed live on stage.\n\nNominated for an Olivier Award, MÁM has enjoyed sellout performances at Sadler’s Wells, London and across Festivals world-wide. This rapturous production now embarks on its debut UK tour for Dance Consortium.\n\nThere will be a post-show Q+A with company members following the first performance on Tue 24 Feb.",
    "date_start": "2026-02-24T19:30:00+00:00",
    "date_end": "2026-02-25T19:30:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/524141/MÁM-Dublin-Theatre-Festival-2019-Ros-Kavanagh-4_cd004cc4a1930617ef98e0c1139bd335.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=70D5FDE4-21C2-4E1C-B81F-1F83F7231982&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Dance",
    "raw_showtimes": [
      "Tue 24 Feb at 7:30",
      "Wed 25 Feb at 7:30"
    ]
  },
  {
    "title": "Ideas Jukebox",
    "description": "Expect puppetry, live music and the opportunity to get involved in this interactive performance and workshop. Watch BIG ideas come to life when we play them on the Jukebox and then add your own ideas to the mix.\n\nIdeas Jukebox will inspire all ages to express their wacky and wonderful ideas through crafting cardboard creations. We desperately need your planet saving plans, fun problem fixes and off-the wall theories, so please join us for the adventure and see which ideas you get excited about.",
    "date_start": "2026-02-26T11:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/526739/IAP-Fay-Guiffo-HazelDarwin-Clements-and-Mamoru-Iriguchi-in-Ideas-Jukebox-image-by-Mamoru-Iriguchi-landscape-HR_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/seatSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=D83EF66E-9038-47A3-A099-B24ED0FA46E1&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Family",
    "raw_showtimes": [
      "Thu 26 Feb at 11:00"
    ]
  },
  {
    "title": "Maya and the Whale",
    "description": "Her dad works in the oil industry and her mum just wants her to have a childhood free of worry, but how can she go about business as usual when there’s a climate emergency? If we stand by and ignore current conflict, are we complicit? How far are young people prepared to go to get governments to act?\n\nThe audience play the part of a dying whale, in this show about smallness facing up to hugeness. This is a darkly comic, provocative show with live music, which was written for a generation faced with unprecedented challenges.\n\nIf you are a teacher and would like to book tickets for your class, please contact our Ticket Sales team by calling 01463 234 234 or emailing [email protected].\n\nMembers of the public are also welcome to book for this performance by clicking the Buy Now button or getting in touch with the Ticket Sales team.\n\nTravel bursaries\n\nWe have some bursaries available to support school travel costs. If you would like to discuss this further, please contact Morag Russell on [email protected].",
    "date_start": "2026-02-26T16:30:00+00:00",
    "date_end": "2026-02-27T11:00:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/568655/IAP-HazelDarwin-Clements-in-MayaAndTheWhale-photo-by-AndrewPerry-letterbpx-LR_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=5B005D5B-CEC0-44CE-88BA-4EA736E1F6D9&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Family",
    "raw_showtimes": [
      "Thu 26 Feb at 4:30",
      "Fri 27 Feb at 11:00"
    ]
  },
  {
    "title": "DANIEL SLOSS: BITTER",
    "description": "Don't miss your chance to catch one of the biggest global names in live stand-up, as Scotland’s international comedy superstar Daniel Sloss unleashes his brilliant and devastatingly hilarious brand-new show BITTER.\n\nDaniel’s massive live tours span 55 countries (so far) including selling out 9 New York off-Broadway theatre seasons. He has been performing stand-up for more than half of his lifetime and has, in the process, broken multiple box office records to become one of the top ticket-selling comedians on the planet. BITTER is his 13th solo show.\n\nHis comedy specials include Jigsaw and DARK on Netflix, X on HBO as well as SOCIO, HUBRIS, X and CAN'T now streaming on DanielSloss.com.\n\nWith special guest KAI HUMPHRIES *",
    "date_start": "2026-02-26T19:30:00+00:00",
    "date_end": "2026-10-02T20:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/543225/Daniel-Sloss-Bitter-1920x1080px_51c80894f5577470d524f001fa20ed26.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=4BF485B4-984C-4A0F-92D7-25AEBE43997A&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Thu 26 Feb at 7:30",
      "Fri 2 Oct at 7:30"
    ]
  },
  {
    "title": "Gary Innes & Ewen Henderson: The 20-Year Road Trip",
    "description": "This Spring, Eden Court welcomes two of the Highlands’ most respected and well-loved musicians, Gary Innes and Ewen Henderson, as they mark 20 years of playing together with a special anniversary concert.\n\nFrom their earliest days playing at dances and weddings throughout the Highlands, to performing all across the globe with Mànran, Gary and Ewen have become leading figures in the Scottish traditional music scene. Their duo performances have taken them to corners as far-flung as Kazakhstan and Shanghai, not to mention once touring the entire West Coast of the United States in a convertible Mustang...\n\nIndeed, it is from these very adventures – plus the musical heritage of their Lochaber upbringing – that their music and stories spring.\n\nBorn in Spean Bridge, Gary picked up an accordion for the first time at the age of 8 and never looked back. He released his first solo album in 2005 with further albums also released to critical acclaim. Adding more strings to his bow, Gary took over from the legendary Dr Robbie Shepherd MBE in 2016 as host of BBC Radio Scotland’s ‘Take the Floor’ and has subsequently added his own Sunday evening requests show, ‘Your Requests with Gary Innes’.\n\nEwen hails from Fort William and was steeped in the traditional music and Gaelic culture of the area from an early age. Starting on the fiddle at five years of age, he subsequently mastered an impressive array of instruments, learning from some true greats of West Highland music, such as Aonghas Grant Snr. Aside from Mànran, Ewen has toured the world with a host of top Scottish and global cross-genre artists including the world-renowned Battlefield Band and World Music pioneers the Afro-Celt Sound System.\n\nWith some old friends from their adventures joining Gary & Ewen on the stage, this promises to be a memorable evening of tunes, songs, reminiscences and craic!",
    "date_start": "2026-02-27T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/526567/kesiak-manran-mar25-122-Edit_79ef50cc5327aa3bf8693284b7e4e897.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=FFBB69C7-8388-4146-9C5E-AE1ABF042FAE&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 27 Feb at 7:30"
    ]
  },
  {
    "title": "Benedetti Plays Mendelssohn",
    "description": "Maxim Emelyanychev conductor\n\nNicola Benedetti violin\n\nMendelssohn:\n\nOverture, The Hebrides\n\nViolin Concerto\n\nSymphony No.3 ‘Scottish’\n\nExperience the magic of Mendelssohn with the Scottish Chamber Orchestra, Principal Conductor Maxim Emelyanychev and superstar violinist Nicola Benedetti.\n\nLet the evocative melodies of the composer’s Overture, The Hebrides transport you to the rugged beauty of Scotland's islands. Witness Benedetti's virtuosity as she performs one of the most beloved violin concertos in the repertoire and finally, immerse yourself in the rich, lyrical landscapes of Mendelssohn's homage to Scotland with his Symphony No. 3 ‘Scottish’.\n\nBook your tickets now for a night of musical brilliance!",
    "date_start": "2026-02-28T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/512495/Benedetti-Plays-Mendelssohn-Web-Size-Template_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=06695F9B-B68E-4D71-B0A7-FBAD64AC22E5&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Classical",
    "raw_showtimes": [
      "Sat 28 Feb at 7:30"
    ]
  },
  {
    "title": "The Rocket Man - A Tribute to Elton John",
    "description": "Pack your bags, strap yourself in, zero hour 7.30pm, for a night like no other as we celebrate Sir Elton John!\n\nThe Rocket Man is the world’s favourite celebration to a musical icon, playing to audiences all around the world and we are delighted to announce our UK tour for 2025. So, catch a star if you can, and wish for something special as we ask you, are you ready for love? No one else recreates the flamboyant megastar with as much vigour and brilliance.\n\nJoin us as The Rocket Man and our amazing live band take you down the Yellow Brick Road with two hours of glorious Elton hits, including, Saturday Night’s Alright, Crocodile Rock, I Guess That’s Why They Call it the Blues, Daniel, I’m Still Standing, Philadelphia Freedom, Your Song and many, many more.\n\nWith dazzling costumes, stunning vocals and sensational piano solos, we take you on a journey through Elton’s life and career, the highs and the lows with many a laugh brought to life, live on stage. This show has it all! So, if it gets to seven o’clock and you wanna rock, book your tickets now!\n\nThe Rocket Man – a magical night in tribute to Sir Elton John\n\nThis is a tribute show and is no way affiliated with any original artists/estates/management companies or similar shows.\n\nPromoter reserves the right to alter the programme.",
    "date_start": "2026-03-01T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/517241/TheRocketMan-1920x1080-entertainers_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=75D958D8-4DF7-43B1-9192-024E5D1CFB4A&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sun 1 Mar at 7:30"
    ]
  },
  {
    "title": "LIONS and TIGERS and BEARS with Gordon Buchanan",
    "description": "Due to phenomenal demand, award winning wildlife photographer and filmmaker Gordon Buchanan will hit the road again in 2026, continuing the success of his biggest ever live tour - Lions and Tigers and Bears.\n\nJoin Gordon as he recounts thrilling encounters with pandas, grizzlies, tigers, jaguars and more. Learn about the heart-stopping moments, the mud, sweat, and tears, and the tender interactions that have shaped his extraordinary career.\n\nGordon Buchanan has dedicated his life to exploring the untamed beauty of the natural world, from the bamboo forests of China to the snowy landscapes of Russia, from the towering Himalayas to the depths of the Amazon. His mission: to capture the majestic big cats and bears on film and reveal their secrets to a global audience.\n\nBook your tickets now and don’t miss the opportunity to be inspired in a night of adventure, awe and wonder!",
    "date_start": "2026-03-03T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/378819/GB_Generic_1920x1080_NoUrl_73203dc170515c0629e51ca5d3a8154e.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=E4FD7555-03A4-46E7-8B80-18AA29DD08B9&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Talks / Special Events",
    "raw_showtimes": [
      "Tue 3 Mar at 7:30"
    ]
  },
  {
    "title": "Hannah Rarity",
    "description": "Award-winning singer, Hannah Rarity, has made a lasting impression since being warmly embraced by the folk world, winning BBC Young Traditional Musician of the Year (2018) and recording and touring with top acts Blazin’ Fiddles, Rura, Niteworks and Cherish the Ladies. Both of her albums ‘Neath the Gloaming Star’ (2018) & ‘To Have You Near’ (2022) have been shortlisted for Album of the Year at the BBC Alba Scots Trad Music Awards and in 2022, she was invited to work as co-musical director for the Opening Concert of Celtic Connections.\n\nPerforming a carefully chosen mix of traditional, contemporary and self-penned material, she earns comparisons to the likes of Eva Cassidy and Cara Dillon, whilst standing confidently in her own right. Equally at home in a number of genres, she is a sought-after collaborator, session vocalist and tutor.\n\nHannah honed her craft at the Royal Conservatoire of Scotland, graduating in 2016 with a First Class BA (Hons) in Scottish Music. She has undertaken featured singer work as part of Brian O’Donovan & WGBH’s ‘A Celtic Christmas Sojourn’ in Boston (2018) and alongside the BBC SSO at Proms in the Park, as well as numerous UK television appearances (BBC Hogmanay 2015, 2017, 2020) and tours in her own right throughout Europe and the UK.",
    "date_start": "2026-03-04T20:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/196837/Hannah_Rarity_by_Elly_Lucas__9_cc4876c3f4f4c4176bd476e5a34d5b47.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=76C9E4F7-2A07-4BD9-927F-72D6650A2119&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 4 Mar at 8:00"
    ]
  },
  {
    "title": "Live at Eden Court - Milton Jones and Friends",
    "description": "LIVE AT EDEN COURT – MILTON JONES & FRIENDS\n\nA Huge Night of Stand-Up Comedy in Inverness!\n\nGet ready for a riotous night of laughs as some of the UK’s top comedy talent takes over the Highlands for one night only! Live at Eden Court – Milton Jones & Friends brings a stacked line-up of stand-up brilliance to Inverness, headlined by one of the biggest names in British comedy.\n\nMILTON JONES – Star of Mock the Week, Live at the Apollo, Michael McIntyre’s Comedy Roadshow and his own Radio 4 series (Thanks a Lot, Milton Jones!), Milton is the king of the killer one-liner. With his trademark wild hair and wild imagination, expect a masterclass in surreal, fast-paced punchlines that’ll leave you breathless with laughter.\n\nJoining Milton is a hand-picked line-up of comedy favourites and rising stars:\n\nJAY LAFFERTY – Regular on BBC Scotland’s Breaking the News, featured on The Comedy Underground and Debate Night. A commanding live performer with razor-sharp wit and no-holds-barred honesty, Jay is a standout talent on the Scottish comedy scene.\n\nGARETH WAUGH – As heard on Radio 4’s The Now Show and BBC Scotland’s Comedy Underground, Gareth blends quick-thinking charm with clever storytelling. A Fringe regular and podcast favourite, he’s a must-see.\n\nIAIN HUME – Finalist in So You Think You’re Funny?, Iain has built a loyal following across Scotland with his dry, relatable style and killer timing. A name to watch, and one to catch live while you can.",
    "date_start": "2026-03-05T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/522529/Milton-Jones_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=47C63DAD-90B4-4A54-95FA-FB5B951577DE&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Thu 5 Mar at 7:30"
    ]
  },
  {
    "title": "A Giant on the Bridge",
    "description": "Unflinching, spellbinding gig-theatre featuring Louis Abbott (Admiral Fallow), Kim Grant (Raveloe), Dave Hook (Solareye, Stanley Odd), Jo Mango and Jill O’Sullivan.\n\n“Do you think cos I’ve been in the jail all I know is how to hurt people?”\n\nEvery year in Scotland thousands of people return home from prison to an uncertain future. A Giant on the Bridge reveals the intimate human experiences within this prison-homecoming journey, in a compelling narrative-gig which fuses acoustic songwriting, Scottish hip hop & original storytelling.\n\nFive of Scotland’s leading contemporary musicians explore identity, family, community, systems, restoration, injustice - and the pulsing heartbeat within these hidden stories.\n\nDevised by singer-songwriter Jo Mango & award-winning theatre-maker Liam Hurley with research by Phil Crockett Thomas. Developed through the work of the Distant Voices Community on a research project with people from across the criminal justice system.",
    "date_start": "2026-03-05T20:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/556521/A-Giant-on-the-Bridge_722dfe712f10c48049c3edf05b5ffd04.jpeg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=BD9F2996-A21F-4C6C-91FC-E36FE4739B3E&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Drama",
    "raw_showtimes": [
      "Thu 5 Mar at 8:00"
    ]
  },
  {
    "title": "Calum MacPhail and his band",
    "description": "Following his 2025 sold out show in the Empire Theatre, local music legend, Calum MacPhail is set to return to Eden Court on Friday 6th March 2026. Hugely talented musician Calum will take to the stage with his incredible band promising a musical mash up like you have never seen before. Prepare to be taken on a musical journey that will have you on your feet and dancing in the aisles. Calum and his band will showcase their versatile musical talents with their take on traditional celtic music in an energetic foot stomping evening. What promises to be THE hot ticket of the year – this is a show not to be missed.",
    "date_start": "2026-03-06T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/490767/Calum-MacPhail-2026_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=53B6B2AB-2869-4905-8A6C-59813C2B9E13&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 6 Mar at 7:30"
    ]
  },
  {
    "title": "Highland Young Musician Concerts Festival 2026",
    "description": "Highland Young Musicians are delighted to return to Eden Court Theatre with our 2026 showcase of the highest quality Highland youth music-making. Six of our outstanding groups will be showcased: Highland Youth Wind Band; Highland Regional Youth Orchestra; ‘Snas; Highland Youth Choir; Highland Youth Strings Orchestra & High Life Highland Pipe Band. These ensembles consist of exceptionally talented young musicians and singers from across the Highlands, rehearsed and nurtured by the amazing Instrumental Music Instructor team & associated professionals at High Life Highland. Prepare to be captivated by their diverse and varied programmes - leaving you with a reinvigorated love for music and a sense of hope for the future of youth music in Highland!",
    "date_start": "2026-03-07T15:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/534465/Highland-Young-Musicians-2026_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=52976843-F69D-4FAD-A728-E71AE46BBA22&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sat 7 Mar at 3:00"
    ]
  },
  {
    "title": "Mark Nelson: Liquid Gold",
    "description": "Multi award winning Scottish stand up Mark Nelson returns with his brand new tour show. One of the most acclaimed and sought after comedians in the UK and abroad, Nelson brings a distinctive mix of cutting observations, social commentary and hilarious one liners.\n\nUK Comedians Comedian Of The Year.\n\n5 time winner of Best Headliner at the Scottish Comedy Awards.\n\nHost of BBC's The Good, The Bad & The Unexpected and Edinburgh Unlocked.\n\nAs Seen And Heard on Have I Got News For You, The News Quiz and Have A Word.\n\nOver 750 million views online.",
    "date_start": "2026-03-07T20:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/530061/MN-FACEBOOK-EVENT-COVER_afd1853ac727aaf5a35b1cd350d6e4e4.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=40AD6679-66BA-46BA-BF8C-D899A8B8C6C0&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 7 Mar at 8:00"
    ]
  },
  {
    "title": "Between Light and Shadow",
    "description": "Programme:\n\nWolfgang Amadeus Mozart - String Quartet No.14 in G Major (Spring)\n\nCaroline Shaw - Second Essay (Echo) and Third Essay (Ruby) from Three Essays\n\nCaroline Shaw - Third Essay (Ruby) from Three Essays\n\nLudwig van Beethoven - String Quartet No.8 in E minor, Op.59 No.2 (Razumovsky)\n\nJoin a quartet of Scottish Ensemble musicians for an evening of emotional contrasts, bold imagination, and luminous soundscapes.\n\nMozart’s radiant Spring Quartet, brimming with optimism and glowing with warmth, is heard alongside two of Caroline Shaw’s Essays that shimmer with sonic texture and emotional nuance. The second part of the programme plunges us into the brooding and introspective music of Beethoven. From stormy drama to moments of sublime beauty, this quartet is Beethoven at his most emotionally raw and visceral.\n\nBetween Light and Shadow invites you to reflect, to feel, and to hear familiar and new music in fresh perspective.",
    "date_start": "2026-03-10T19:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/525981/Between-Light-and-Shadow_11c04fbd58a3ab2355e570e5dabe414b.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=F91E858C-AAB2-4B51-8686-F22E5091499D&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Classical",
    "raw_showtimes": [
      "Tue 10 Mar at 7:00"
    ]
  },
  {
    "title": "Live Forever – The Rise of Britain’s Greatest Rock ‘n’ Roll Band",
    "description": "Due to unforeseen circumstances, the producers of Live Forever have regrettably made the very difficult decision to cancel the 2026 tour. We sincerely apologise for any disappointment this may cause.",
    "date_start": "2026-03-10T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/507591/LiveF-fb-cover_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=455B5590-BB8E-4DAC-8677-763B259FDF41&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Tue 10 Mar at 7:30"
    ]
  },
  {
    "title": "Ben Portsmouth: This is Elvis",
    "description": "Ben Portsmouth brings you his jaw-dropping tribute to the King of Rock ‘n’ Roll!\n\nWith global success in over 20 countries including sellout performances on the same Vegas stage as Elvis, to London's West End, don’t miss Ben Portsmouth: This is Elvis, at Eden Court!\n\nMaking history in 2012, Ben broke records becoming the first European to be crowned by Elvis Presley Enterprises as the ‘Worldwide Ultimate Elvis Tribute Artist’ in Memphis, which swiftly followed with an invite to headline a special Elvis week on the Late Show with David Letterman.\n\nCelebrating the life of an iconic showman, Ben and the Taking Care of Elvis Band will take you on a trip down memory lane with many of Elvis' most loved songs from all eras including the 1950s, the iconic '68 Comeback Special, and Ben's personal favourite, the 1970s Vegas concerts.\n\nWith his looks, charm and charisma, Ben is recognised as the world's leading Elvis tribute artist - he continues to amaze audiences with his stage presence, with fans globally claiming, 'this is the closest you will ever get to the King!'.\n\nJoin us for a phenomenal evening with Ben and the band!",
    "date_start": "2026-03-11T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/482563/TCE-Elvis-World-Tour-2023-Poster-05-Leathers-Acoustic-A3-Landscape-Clean-16bit-300dpi-v6.7_1a918492f927ffa56377c592ac62741a.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=54DA61D8-5AE1-489A-A3C0-EE7CCADB31D8&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 11 Mar at 7:30"
    ]
  },
  {
    "title": "QUEENZ: Drag Me to the Disco!",
    "description": "Direct from London’s West End and following their sensational Las Vegas debut, these fearless and fabulous Queenz are bringing their electrifying live vocal drag-stravaganza to the stage. Get ready for a night where Dancing Queenz and Disco Dreams collide, delivering the ultimate celebration of pop royalty through the decades.\n\nNot just glitz and glamour - Drag Me To The Disco is packed with undeniable heart, powerhouse talent, and breathtaking vocals. Prepare to sing your heart out, laugh until it hurts, and even shed a tear as these queens take you on a rollercoaster of emotion and high-energy entertainment. With more sequins, surprises, and star power than ever before, this dazzling spectacle is a must-see.\n\nUnfiltered fun. Unstoppable talent. And, of course, DISCO DIVAS!",
    "date_start": "2026-03-12T19:30:00+00:00",
    "date_end": "2026-03-13T19:30:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/497795/Queenz-Eden-Court-2500x1500-Template-No-Quotes_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=FB49DBEB-C44F-406A-BD9F-9EE5AD33F9E2&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 12 Mar at 7:30",
      "Fri 13 Mar at 7:30"
    ]
  },
  {
    "title": "Paul Merton and Suki Webster's Improv Show",
    "description": "Following critically acclaimed seasons in London and Edinburgh, Paul Merton and Suki Webster, two of the UK’s leading improvisers, present an evening of wonderfully unscripted cutting-edge comedy.\n\nExpect a show full of fast, fabulously funny improvised games, scenes, stories and laugh out loud surrealism as these two masters of Comedy Improvisation join forces with their very special guests to create cascades of laughter and joyful silliness.",
    "date_start": "2026-03-14T20:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/484275/PMSW_ImprovShow_Clean_IMAGE_8ee833a283c7602602165add5c37b201.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=97803216-246B-4A28-95E2-BB1562A44036&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 14 Mar at 8:00"
    ]
  },
  {
    "title": "Out of this World",
    "description": "Soar Out of this World with Children's Classic Concerts and their very own 20-piece Essential Orchestra. Boldly going where no orchestra has been before, the CCC Enterprise will take you on an orchestral odyssey exploring musical galaxies far, far away - and perhaps meeting some instrument-playing aliens along the way! Ideal for children ages 4-12 and their families, this is perfect entertainment for the whole family and a cosmic introduction to the orchestra.",
    "date_start": "2026-03-15T15:00:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/526571/Out-of-this-World-2500x1500_afd1853ac727aaf5a35b1cd350d6e4e4.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=0AECED55-2A3E-4084-B0A7-6608471B0C00&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Family",
    "raw_showtimes": [
      "Sun 15 Mar at 3:00"
    ]
  },
  {
    "title": "What's Love Got to Do With It? The Ultimate Tribute to Tina Turner",
    "description": "After a sensational 2025 that saw over 60,000 Tina Turner fans across the UK singing, dancing, and having the time of their lives, What’s Love Got To Do With It? is back and bigger than ever for 2026! This electrifying tribute show celebrates the music and unparalleled career of the one and only Queen of Rock ‘n’ Roll, Tina Turner.\n\nGet ready for an unforgettable evening of high-energy, feel-good rock and soul, brought to life by a phenomenal live band. Packed with all the classic hits you know and love, the show delivers showstopping performances of Proud Mary, River Deep – Mountain High, Simply The Best, Private Dancer, Nutbush City Limits, and many more.\n\nStepping into Tina’s iconic heels is Kent’s own Holly Bannis, the daughter of Greg Bannis, former lead singer of Hot Chocolate. Holly’s rise to centre stage is as inspiring as it is exciting. Growing up in a musical family, Holly honed her craft for over a decade performing semi-professionally before an audition on ITV’s Starstruck changed her life. “I had to audition as three of my musical icons, and Tina was an obvious choice for me. During lockdown, I studied her performances obsessively, getting into her moves, her walk, and her energy.”\n\nIt wasn’t long before the team behind What’s Love Got To Do With It? noticed Holly’s raw talent and passion. Initially cast as a backing singer and understudy, Holly quickly stepped into the spotlight, making the lead role her own and earning standing ovations night after night.\n\nAudiences can expect a show bursting with energy, emotion, and that signature Tina fire. The production kicks off with hits like Private Dancer, as Holly fully inhabits Tina’s powerful vocals and unmistakable moves, transporting fans to the heart of a live Tina Turner concert experience. Then, in the show-stopping second half, the audience is guaranteed to be on their feet, dancing and singing along to high-octane classics like Nutbush City Limits.\n\nWhat’s Love Got To Do With It? isn’t just a concert – it’s a celebration of Tina Turner’s legacy, a night of unrelenting joy, and a tribute to one of the most electrifying performers in music history.\n\nPlease note that this is a tribute production and is not endorsed by or affiliated with the Tina Turner Estate.",
    "date_start": "2026-03-18T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/507891/1080x1080_NEW-TINA-2023_09705fbcca55688f6f90fb95939a7c4e.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=A99DC39E-105B-4C89-A0F3-E57DBAFC8D12&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 18 Mar at 7:30"
    ]
  },
  {
    "title": "Seven Drunken Nights - The Story of the Dubliners",
    "description": "Proudly celebrating its incredible 10th Anniversary Seven Drunken Nights - The Story of The Dubliners is back for 2026!\n\nPerformed by a phenomenal cast of Irish musicians, the show is packed full of classics like Whiskey in the Jar, The Irish Rover and Rocky Road to Dublin - guaranteed to get your toes tapping as they bring the joy of this much-loved Irish folk band back to the stage.\n\nThis ultimate feel-good production celebrates the musical mastery of The Dubliners, Ireland’s favourite sons, in association with the legendary O’Donoghue’s pub.\n\nWith breathtaking performances and authentic Irish spirit, the show spans over 50 years, commemorating The Story of The Dubliners for a night of great music, and a celebration of the band that influenced many generations of Irish music.\n\nDon’t miss your chance to see the world class production that’s brought a decade of unforgettable nights to packed out theatres. Seven Drunken Nights is the ultimate Irish show that has audiences across the globe returning year after year.",
    "date_start": "2026-03-19T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/521975/SDN-26-fb-1200x628_08b09aaf862b3e15c666075069219626.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=ADA8CF44-3C75-4904-B59F-084C28DFFAFF&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 19 Mar at 7:30"
    ]
  },
  {
    "title": "Flora",
    "description": "In this new musical about one of Scotland's most famous daughters, Flora is a reluctant heroine caught up in the power games of the men around her, as she braves imprisonment, fame, famine, migration and war in her lifelong struggle to keep her family safe.\n\nMaking its world premiere at Eden Court, Flora is a whirlwind of ensemble storytelling, using catchy, trad-inspired music with contemporary verse to present Flora MacDonald's epic life story as if in her own words.\n\nWritten by Belle JonesMusic by AJ Robertson and John KieltyDirected By Stasi Schaeffer",
    "date_start": "2026-03-20T19:00:00+00:00",
    "date_end": "2026-03-21T19:00:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/559123/MH_Flora_1200x600_title_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=D3D58B10-2CD2-4629-B308-DCEA730959D8&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Musicals",
    "raw_showtimes": [
      "Fri 20 Mar at 7:00",
      "Sat 21 Mar at 2:30",
      "Sat 21 Mar at 7:00"
    ]
  },
  {
    "title": "THE ETERNAL SHAME OF SUE PERKINS",
    "description": "You may know her as Bake-Off Sue, Taskmaster Sue, Just A Minute Sue, or the Sue that gives you travel envy - but stand-up Sue is full of surprises. In this brand-new show, she shares the unlikely happenings from a career in the spotlight.\n\nWhat’s the fallout when your pituitary gland goes haywire on live TV? How do you convince the public you didn’t really fall onto that hoover attachment? And when intimate photos get splashed all over the internet, how do you switch the shame to dignity and joy?\n\nIn her first live show in over a decade, Sue delivers a hilarious treatise on stigma, humiliation, and misunderstanding.",
    "date_start": "2026-03-20T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/490127/THE-ETERNAL-SHAME-OF-SUE-PERKINS-2026-Tour-photo-by-Steve-Ullathorne_3a7aa9608d1d66cef400c7f11a848168.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=A1FC8E6D-B279-4A7B-81E7-2C20AC466BA0&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 20 Mar at 7:30"
    ]
  },
  {
    "title": "Inverness Fiddlers' Rally 2026",
    "description": "The Fiddlers’ Rally has always been a popular event in the Eden Court calendar and the last such event saw the Inverness Fiddlers performing for another much-appreciated, rousing and well-attended performance.\n\nOnce again the Fiddlers will be joined by fellow enthusiasts from all over Scotland to form an orchestra of around 100 players performing a varied program of traditional music from Scotland and beyond. The Fiddlers’ Rally provides both a visual and a musical spectacle since the performers are tartan-clad for this musical highlight.\n\nThis year the Inverness Fiddlers will be delighted to be joined by talented guest artists The Calum MacColl Trio during the performance. Calum MacColl is well known to Highland audiences as the accordion-playing TV weatherman who has been known to burst into song on air.\n\nSeats for the Fiddlers’ Rally are sure to be much in demand, so you are recommended as always to secure your ticket well in advance of the performance date.",
    "date_start": "2026-03-21T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/512391/Inverness-Fiddlers-Rally-2026_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=AF7CCC63-18F2-4E9F-9256-2FEC2E5A1E88&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sat 21 Mar at 7:30"
    ]
  },
  {
    "title": "Anything Goes",
    "description": "Inverness Musical Theatre invites you to join them as they strut, dance and sing their way into their second century of showbiz with the sensational “Anything Goes”.\n\nClimb aboard the SS America and find yourself whisked away on a voyage filled to the brim with spectacular dancing, larger than life characters and madcap antics.\n\nFeaturing everything from romantic duets, to rousing ensemble numbers that will have you wanting to jump up on deck and tap along, “Anything Goes” is awash with some of the most iconic songs of the 1930s.\n\nThe SS America’s crossing from New York to London is set to be a high brow affair. However, forbidden romances, multiple stowaways and a healthy helping of mistaken identities ensure that this luxury cruise will be one that the passengers, and audience, will not soon forget.\n\nHot on the heels of their fabulous 100th anniversary show, “Singin’ in the Rain”, Inverness Musical Theatre welcomes you on deck to enjoy the trouble-free thrill of a night at sea.",
    "date_start": "2026-03-25T19:30:00+00:00",
    "date_end": "2026-03-28T19:30:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/540655/AG-Eden-Court-Web-Banner-2_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=F88E80F0-51B7-4007-BB2E-B0E6F7C3C901&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Local / Showcase",
    "raw_showtimes": [
      "Wed 25 Mar at 7:30",
      "Thu 26 Mar at 7:30",
      "Fri 27 Mar at 7:30",
      "Sat 28 Mar at 2:30",
      "Sat 28 Mar at 7:30"
    ]
  },
  {
    "title": "The Shoop Shoop Show – The Cher Collection",
    "description": "Become an Eden Court Friends member to book your tickets from Wed 9 Apr, 10am. Find out more and sign up by clicking here.\n\nGeneral tickets will be released from Fri 11 Apr, 10am.\n\nGet ready to experience a Cher show like no other – heading to theatres across the UK and Europe in 2026!\n\n‘Turn Back Time’ with The Shoop Shoop Show - The Cher Collection, an exhilarating music-led production with a party atmosphere. It is led by international powerhouse vocalist Rachael Hawnt, the winner of ITV’s Starstruck.\n\nThe show spans every decade of Cher’s incredible career so be prepared to be dazzled by disco HITS and pop rock chart-toppers. As the show unfolds Rachael’s spot-on impersonation will make you ‘Believe’.\n\nAs if that wasn’t enough, the singing sensation performs songs from Cher’s iconic ‘Dancing Queen’ album, belting out unforgettable sing-along renditions of ABBA's greatest hits.\n\n‘Dressed to Kill’ with incredible custom-made costumes, jaw-dropping production, choreography and a world class live band, The Shoop Shoop Show - The Cher Collection will have you singing and dancing the night away.\n\n2026 really is the ULTIMATE time to celebrate the music of Cher, as the Goddess of Pop herself turns 80.\n\nSo, grab a ticket, glam up, and come and experience the magic of one of the greatest Divas of all time!",
    "date_start": "2026-03-30T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/499547/Shoop-fbevent-1920_23f0bb2ae7ac2657b1f35b2498bc1b64.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=2EE572A1-CDB7-42C9-AEF7-703D875DF182&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Mon 30 Mar at 7:30"
    ]
  },
  {
    "title": "SCOTS - The Musical",
    "description": "SCOTS is the story of Scotland. Its past, present and future. Its people and places, triumphs and failures. All told by a figure who has seen it all… Someone who witnessed the Picts and the Celts unite; who survived the battles of Stirling and Bannockburn; who heard the declaration of Arbroath; who witnessed Scottish Enlightenment, the Industrial Revolution, the charge for women’s rights, the battle for gay rights, the call for Independence - basically someone who’s seen some amount of s**t - Scotland’s greatest invention ... The Toilet!\n\nSCOTS is an irreverent, hilarious and poignant journey through the history of Scotland. A multi-skilled ensemble retell some of our nation's most iconic (and some forgotten) stories, all to answer the fundamental question: What makes a country?\n\nFollowing ecstatic reviews at the Edinburgh Fringe, this 'truly incredible' (Broadway World) show has been upscaled and will tour main stages across Scotland, as a Raw Material production, in association with Beacon Arts Centre.",
    "date_start": "2026-03-31T19:00:00+01:00",
    "date_end": "2026-04-01T20:00:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/571673/SCOTSECWEBcorrect_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=EA7A859D-FC2F-4DBD-9AAC-B9EB643C63AA&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Musicals",
    "raw_showtimes": [
      "Tue 31 Mar at 7:00",
      "Wed 1 Apr at 7:00"
    ]
  },
  {
    "title": "Spirit of the Highlands and Islands",
    "description": "This special one-off concert will feature some of the most popular names in Highland traditional music. Details of the full line up will be released in the coming months. The performance will also include the premiere of ‘River’ by James Ross with co-creators Colin MacDonald and Julie Fowlis. Performed by James, Julie, and the string ensemble, Thirteen North, River has been inspired by the incredible Tapestry of the Highlands and Islands, featured in The Inverness Castle Experience.",
    "date_start": "2026-03-31T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/526595/Spirit-of-the-Highlands-and-Islands_afd1853ac727aaf5a35b1cd350d6e4e4.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=C78F29AE-26BB-4222-9FFB-889BBDE5C967&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Tue 31 Mar at 7:30"
    ]
  },
  {
    "title": "Taylormania",
    "description": "TAYLOR SWIFT ERAS TRIBUTE CONCERT\n\nAn award-winning extravaganza that plays tribute to one of the leading contemporary recording artists of our time. Katy Ellis a self confessed ‘Swiftie’ with an incredible live band and dancers promises to deliver the most authentic recreation of a Taylor Swift show you will ever see.\n\nThe show has already taken ‘Swiftie’ fans across the world by storm and features all of Taylor’s much loved hits including; Shake It Off, Blank Space, Love Story, You Belong With Me, Look What You Made Me Do, I Knew You Were Trouble and many, many more.\n\nNot to be missed TAYLORMANIA is coming to a theatre near you.\n\n*TAYLORMANIA is a fan-sponsored event and not endorsed by or in any way affiliated with TAS Rights Management, Taylor Swift, or their affiliated entities, and the event organisers have indemnified TAS Rights Management, Taylor Swift, or their affiliated entities against any and all claims relating to any injury, death, or other harm that could befall event attendees.",
    "date_start": "2026-04-02T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/518641/Taylormania-1920-X-1080_161ea492822deed601eafe6e958b75fd.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=E8318902-BD69-45EA-AC4E-0EE1D8978E38&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 2 Apr at 7:30"
    ]
  },
  {
    "title": "An evening with Tam Cowan hosted by Graham Spiers",
    "description": "An Evening with Tam Cowan\n\nTam Cowan has been beyond dispute the funniest man in Scottish football for the past 25 years. Bawdy and razor-witted the Bard of Motherwell sees the funny side of every aspect of life and has his audiences in fits of laughter. Cowan has enjoyed a sold-out run at the Edinburgh Fringe and now brings his outrageous humour to Eden Court for an evening of jokes and poking fun. Hosted by Graham Spiers (though Graham won’t get a word in edgeways).",
    "date_start": "2026-04-02T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/562051/Tam-Cowan_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=378DF4C6-9360-4CC2-B365-5903326CAE74&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Talks / Special Events",
    "raw_showtimes": [
      "Thu 2 Apr at 8:00"
    ]
  },
  {
    "title": "The ELO Tribute Show",
    "description": "THE ELO SHOW – The World’s Greatest tribute to Jeff Lynneand E.L.O are back on the road in 2024 with a stunning new stage production, featuring a band of amazing musicians complimented by a female string section and playing hit after hit from ELO’s vast back catalogue.After touring and selling out venues all over the UK and Europe, this show gets bigger every year, now with a dazzling light and laser show, 3D video screens modeled on ELO’s own touring show design and even a huge spaceship!\n\nWith beautiful harmonies from six singers, string section and world class band, this really is as close as you will get to the Real Thing.\n\nExpect songs like, Evil Woman, Don’t Bring Me Down, Telephone Line, Sweet Talkin Woman, Turn to stone, Wild West Hero, The Diary of Horace Wimp and of course the legendary Mr. Blue Sky plus many more with a surprise or two.Don’t miss out on this fantastic night of nostalgia and classic tunes.",
    "date_start": "2026-04-03T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/388347/TheELO-Social-media_240722_141225_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=C2973F68-4EC1-44E0-97AB-E8EA47F96320&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 3 Apr at 7:30"
    ]
  },
  {
    "title": "Jack Docherty In The Chief - No Apologies",
    "description": "As seen on BBC Scotland’s Scot Squad and The Chief, this national hero will be bringing his wit and wisdom (and let’s be honest, his still simmering good-looks) to a theatre near you.\n\nYou may have seen The Chief’s ‘Apology sketch’ - a viral sensation, racking up more than 80 million views - well now’s your chance to see The Chief live in his critically acclaimed, sell-out show, No Apologies.\n\nThe show will feature your favourite sketches from Scot Squad and lots of hilarious new jokes as The Chief dissects the state of the nation, from politics to policing, football to families, bams to biscuits.\n\nThe Chief will also read excerpts from his forthcoming best-selling memoir, No Apologies, a book that tells his unique personal story of how a white, middle-class, public school educated boy from Edinburgh somehow overcame all the odds to become the Chief Commissioner of The Scottish Police Force.\n\nThis is sure to be the theatrical event of this, or any other, year. Don’t miss out!\n\n(Please note - band and radges will be denied entry)",
    "date_start": "2026-04-04T14:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/556417/JD26-Tour-1920x1080-notext_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=59CAC270-299E-4D5D-A305-2938CF67B16A&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 4 Apr at 2:30",
      "Sat 4 Apr at 8:00"
    ]
  },
  {
    "title": "Eden Court at 50 - An Evening with RSNO featuring Scottish Opera",
    "description": "Become an Eden Court Friend to book your tickets from Wed 14 Jan, 12pm. General sale opens Fri 16 Jan, 12pm.\n\nOn the 14th April 1976, the RSNO and Scottish Opera performed at Eden Court’s opening performance on the Empire stage. Fifty years on, almost to the day, we welcome them back to kick off the celebrations for our 50th anniversary programme.\n\nLed by conductor Leonard Slatkin, the RSNO open the concert by performing Confluence, a work commissioned for the 1976 gala composed by local, William Wordsworth. Following this, a double-helping of Ravel, firstly from Scottish Opera with a solo performance from emerging artist Daniel Barett, followed by a virtuoso violin performance from Igor Yuzefovich - performing Tzigane.\n\nClosing the concert, the orchestra will delight audiences with the triumphant, celebratory Symphony No. 5 by Tchaikovsky.\n\nThis stunning programme has been curated to mark Eden Court’s milestone 50th Anniversary.\n\nConfluence – William Wordsworth (00h14)\n\nDon Quichotte à Dulcinée – Ravel (00h10); solo: Daniel Barrett, Scottish Opera Emerging Artist\n\nTzigane – Ravel (00h11); solo: Igor Yuzefovich, Royal Scottish National Orchestra Principal Guest Leader\n\nInterval\n\nTchaikovsky V (00h47)\n\nConductor for RSNO: Leonard Slatkin",
    "date_start": "2026-04-04T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/570123/RSNO-Full-Orchestra_799d08c54026c35cb89656df0323d339.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/login.asp?targetPage=mapSelect.asp%3FdoWork%3A%3AWSmap%3A%3AloadMap%3DLoad%26createBO%3A%3AWSmap%3D1%26BOparam%3A%3AWSmap%3A%3AloadMap%3A%3Aperformance_ids%3D7AFCCEFB-1C6B-4D91-83DB-5490D34647DD%26returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Classical",
    "raw_showtimes": [
      "Sat 4 Apr at 7:30"
    ]
  },
  {
    "title": "Country by Candlelight",
    "description": "Calling all country music fans... we’ve got a show guaranteed to heal your Achy Breaky Heart! Country By Candlelight is finally here, so it’s time to pour yourself a cup of ambition and get ready to dance the night away!\n\nFeaturing a spectacular cast of world-class vocalists and an incredible live band, forget your 9 to 5, as you experience the biggest and best of country music, like never before - all performed live by candlelight at Eden Court!\n\nGet ready to hear all your favourite hits, from Dolly Parton, Luke Combs, Kenny Rogers, Rascal Flatts, Shania Twain, John Denver, Darius",
    "date_start": "2026-04-08T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567361/FACEBOOK-HEADER_a62b20189d72138a6788273009d72f09.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=A1DE5594-F5AA-4768-B0E7-DE9401BD664C&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 8 Apr at 7:30"
    ]
  },
  {
    "title": "Nick Cope Family Show 2026",
    "description": "Come and join Nick Cope for a delightful fun filled musical hour featuring all your favourite Nick Cope hits and more.\n\nNick has been writing and recording his beautiful and totally unique songs for children and their families for over 10 years, he performs with his guitar and stunning animations to sell-out crowds all over the country.\n\nHis fanatical following of little and not so little fans has grown immeasurably over the last couple of years due to the phenomenal success of the CBeebies show ‘Nick Cope’s Popcast’.\n\nNick has a magical way of reaching into people’s hearts, igniting children’s imagination in an organic, unpatronizing, educational and fun way.\n\nWith his charming songs and humour Nick engages, entertains, and enthrals all generations.\n\nNick’s live performances are legendary. If you haven’t heard his songs or seen his shows before, come along and find out what you’ve been missing.",
    "date_start": "2026-04-09T11:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/548219/new-logo-banner_afd1853ac727aaf5a35b1cd350d6e4e4.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=AE1B56BD-758B-4EFD-B009-9DA864E70F8C&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Family",
    "raw_showtimes": [
      "Thu 9 Apr at 11:30",
      "Thu 9 Apr at 2:30"
    ]
  },
  {
    "title": "Susie McCabe: Best Behaviour",
    "description": "The Billy Connolly Spirit of Glasgow award winner Susie McCabe is back! On the back of her sold out shows Femme Fatality and Merchant of Menace, this year she is on her Best Behaviour.\n\nAfter supporting Kevin Bridges, Jason Manford and John Bishop on tour, as well as appearing on TV’s Have I Got News For You, Frankie Boyle's New World Order and radio shows such as News Quiz, Just a Minute and Off The Ball and another successful Edinburgh Fringe run, she is heading back out on the road with another brilliant new show.\n\nShe can also be heard on the smash-hit podcast Here Comes The Guillotine, alongside Frankie Boyle and Christopher Macarthur Boyd sharing their subversive and darkly funny opinions on the chaos of the world.",
    "date_start": "2026-04-10T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/535919/Susie-McCabe-2160x1080_d1e92575b7c64e6e5e791ee435039fe1.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=2CA1928A-A6FD-4FAD-9B06-95B2CFDCA7EF&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 10 Apr at 7:30"
    ]
  },
  {
    "title": "Cally Beaton - Namaste Motherf*ckers",
    "description": "Namaste Motherf*ckers is the new show from Cally Beaton (QI, Live at the Apollo) - a quick-witted, unexpected and unapologetic insight into life in midlife. Combining Cally’s comedic and storytelling prowess with extracts from her provocative, stereotype-busting book of the same name, the show has at its heart her own story of radical reinvention – taking her from meetings in boardrooms to treading the boards, thanks to a chance conversation with the late, great Joan Rivers. A funny show about a deadly serious subject, Namaste Motherf*ckers is a celebration of and for the female of the species. Invisible no more.\n\nThe show includes a Q&A and meet-and-greet with Cally (who knows, Jeff the wonder dog may even be there too).",
    "date_start": "2026-04-10T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/508313/1600x900-cally_7ad545c1ecfd0a241c98fd3cb5490d42.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=5D968ACA-D6F6-4CAC-92CF-563AF8F4CBAE&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 10 Apr at 8:00"
    ]
  },
  {
    "title": "Medea",
    "description": "Everyone knows how Jason won the Golden Fleece - everyone knows how he became a hero for all time - and everyone knows the part his wife, Medea, played in creating his legend - don't they?\n\nErased from the narrative - abandoned by her husband for a new wife and a new life - left isolated and alone in a city where she does not and cannot belong - Medea begins to plot revenge - a terrible, bloody revenge that will send a howl of rage echoing through the ages.\n\nThe award-winning production of this thrilling Greek tragedy returns re-imagined to tour Scotland's stages.",
    "date_start": "2026-04-11T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/556255/eden-court-2500x1500px_1daab7a2bf000482ce744c343a6a6f67.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=D6ED31E1-F0AD-4BF8-86F9-14F4F207DD4C&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Drama",
    "raw_showtimes": [
      "Sat 11 Apr at 8:00"
    ]
  },
  {
    "title": "Cruinn Còmhla: Acoustic Gaelic Night with Laura Wilkie and Ian Carr",
    "description": "Thig còmhla rinn airson oidhche shònraichte de cheòl aig Cruinn Còmhla anns an t-seipeal far am bi Laura Wilkie agus Ian Carr a' toirt thugainn an tionndadh aca fhèin air òrain luaidh bhon chlàr Vent le taic bhon còmhlan òg Cuilbhidh.\n\nLaura & Ian are two leading figures in today’s contemporary traditional music world. Their performances centre around Laura’s debut album ‘Vent’ released on Hudson Records; a deep, immaculately researched dive into ancient women’s work songs (also known as ‘Waulking’ songs) from the Outer Hebrides.\n\nRelishing the chance to transform this material on the concert stage, and gleefully tearing into blistering high octane original compositions, their performances fly by, such is the rich variation in tempo and mood, as they tear the tunes apart, stitching them together again, teasing them into new shapes and textures with passion and humour.\n\nUp and coming band Cuilbhidh will open the performance.\n\nWith thanks to funding from Maoin nan Ealan Gàidhlig.\n\nPlease be aware capacity is very limited in our chapel.",
    "date_start": "2026-04-12T14:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567375/Laura-Wilkie-and-Ian-Carr_a938926bd4879da16ea1839a07d4de75.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=CD5355DD-5437-4D3D-A2D4-431DF520D195&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sun 12 Apr at 2:00"
    ]
  },
  {
    "title": "World's Evolution",
    "description": "Do you remember where you come from? Do you know who you are? Do you know where we are going?\n\nWorld’s Evolution is more than a dance show — it’s a journey. From our roots to the rush and rhythm of today’s world, it follows the story of humanity — our growth, our struggles, and our shared future.\n\nAt the core is Africa: the motherland, the origin, the spark. Through movement, World’s Evolution explores how far we’ve come and dares us to ask where we’re headed. It’s a space to reflect, to confront the now, and to dream of a world where we move freely and together.\n\nFusing street dance styles like Hip-Hop, Krump, Popping and the deep grooves of African and Caribbean dance, this show embarks you on a movement journey that is bold, experimental, and emotionally engaging.\n\nBrought to life by THREE60, a bold collective who continuously pushes the boundaries of the dance landscape in Scotland and beyond, World’s Evolution honours the power of movement cultures in shaping today’s world.\n\nLet’s dance it forward!",
    "date_start": "2026-04-14T19:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/556527/Worlds-Evolution-by-THREE60-2500-x-1500-px_Eden-Court_afd1853ac727aaf5a35b1cd350d6e4e4.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=8FDADB66-61F2-425B-ACE6-057E53CAEC67&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Dance",
    "raw_showtimes": [
      "Tue 14 Apr at 7:00"
    ]
  },
  {
    "title": "Kris Drever",
    "description": "Kris Drever is among Scotland’s most acclaimed and distinctive contemporary musicians, celebrated for his warm voice, virtuosically expressive guitar playing and imaginative and evocative songwriting. Raised in the Orkney Islands, Drever has carved out a unique place at the intersection of traditional folk and modern acoustic music, as a solo artist and as one third of the award-winning trio Lau.\n\nOver the course of his career, Kris has won hatfuls of honours, including BBC Radio 2 Folk Awards for Best Singer, Best Original Song, and Best Group with Lau. His solo work combines lyrics of depth and authenticity with expertly pitched arrangements, exploring themes of place, identity, and social change, delivered with clarity, compassion, and poetic insight.\n\nKris will be playing some brand new songs as well as a selection from his back catalogue of originals and his storied interpretations of traditional material.\n\nAnnie Dressner is a singer-songwriter, originally from New York City but now living in Cambridge. Brimming with razor sharp wit, emotional poignancy and glorious melodies, Annie’s straightforward lyrical style, smart wordplay and lilting vocals offer listeners a front row seat to her captivating stories.",
    "date_start": "2026-04-15T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/522011/kesiak-drever-analog-may25-026-Edit_81693d1a87742a0e531a1e9d54bc98ec.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=528E7A81-CB6D-4A98-B98C-60ED177D68E0&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 15 Apr at 8:00"
    ]
  },
  {
    "title": "LINDISFARNE",
    "description": "Legendary 70’s Tyneside folk-rock pioneers Lindisfarne present a classic five-piece line-up of long-time members fronted by founder-member Rod Clements on vocals, mandolin, fiddle and slide guitar.\n\nWith a repertoire of unforgettable songs like Meet Me On The Corner, Fog On The Tyne, Lady Eleanor and Run For Home and a reputation for live performance second to none, Lindisfarne’s power to galvanize festival and concert audiences remains undimmed and is guaranteed to get the crowd on their feet and singing along.",
    "date_start": "2026-04-16T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/562655/PREFFERED-PRESS-PHOTO-20252026-credit-Chris-Maynard_f3a8a0c1484c0073af1bdeef4f9de3c7.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=C81CAF5A-181E-4C61-B494-4BD305E979FD&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 16 Apr at 7:30"
    ]
  },
  {
    "title": "Henning Wehn - Acid Wehn",
    "description": "Award-deserving German Comedy Ambassador Henning Wehn takes an unbiased look at climate change, a topic sure to delight audiences and no surprise. After all, everyone loves talking about the weather. Rain or shine, all will be fine. Or maybe it won’t. Who knows?! Come along. Or else.\n\nHenning's most recent television and radio appearances include \"Have I Got News For You\" BBC1, \"Would I Lie To You\" BBC1, “House Of Ganes” BBC2, \"Live At The Apollo\" BBC2, \"Guessable\" Comedy Central, \"Question Time\" BBC1, \"8 Out Of Cats Does Countdown\" Channel 4, \"Fighting Talk\" BBC Radio 5 Live, “I’m Sorry I Haven’t A Clue” and \"The Unbelievable Truth\" BBC Radio 4.",
    "date_start": "2026-04-17T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/507181/Henning-Wehn-1920x1080_0ab802d503b31135c8302e541b7b6e20.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=EF908BE2-84B2-4B95-91BE-D042A50322AD&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 17 Apr at 7:30"
    ]
  },
  {
    "title": "Session A9 Still Alive @ 25",
    "description": "Over the last 25 years, Session A9 have earned their reputation as one of the best live bands in the country, adored by fellow artists and the wider public alike. It is no wonder they are frequently described as a “Scottish Supergroup”. A concert review in The Times quoted “Playing with zest, finesse, harmonic sensitivity and an element of cheek and mischief”.\n\nThe 7-piece band is Kevin Henderson, Adam Sutherland, Gordon Gunn and Charlie Mckerron on fiddles, David Robertson on percussion, Marc Clement on guitar and songs, and Brian Mcalpine on keyboards. Some are members of Capercaillie, The Nordic Fiddlers Bloc, Treacherous Orchestra, The Grit Orchestra and The Celtic Fiddle Festival as well as others. “All the band members have very busy lives but the love of playing live music together keeps driving us and we want to do more”, says Charlie Mckerron.\n\nSession A9 have gone on to record six albums, the most recent being “The Magic Roundabout”, which was nominated for Album of the Year at The Scottish Traditional Music Awards. This is not the first time the band have been involved in these awards, in 2012 they were honoured to collect the award for “Best Live Act”. Scottish singer/songwriter Dougie Maclean has been quoted as saying “Session A9 are the best band to come out of Scotland in 100 years” and The Proclaimers stated that they are “tighter than James Brown” after watching their performance at Glastonbury Festival.",
    "date_start": "2026-04-17T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/541237/Session-A9-close-up-2024_c6fea396213226b383a8a338bf531389.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=E4C26D16-6AC9-4E52-8038-FEB5118747CC&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 17 Apr at 8:00"
    ]
  },
  {
    "title": "Eddi Reader",
    "description": "Celebrating over 40 years as a live performer, Eddi Reader has effortlessly developed into one of popular music’s most thrilling and affecting performers. What sets Eddi apart is the depth and quality of the emotional performance and ability to not only move the listener, but connect her experience to that of her audience. No two performances are ever the same.\n\nThough first brought into the limelight as front woman for Fairground Attraction, who’s #1 single, Perfect and parent album, First of a Million Kisses, both topped the charts in the U.K., Europe, Australia, New Zealand and Japan, it was Eddi’s subsequent solo albums that signaled her ability to assimilate different musical styles and make them very much her own. Notably, The Songs of Robert Burns (2003) is a timeless interpretation showcasing the poems of Scotland’s national bard and gained her honorary degrees from Strathclyde University, Caledonia University, Stirling University, Edinburgh University and Paisley University as well as an MBE for outstanding contributions to the Arts.\n\nWith her work in song, from the traditional to the contemporary, Eddi Reader extinguishes the preordained boundaries of genre, bringing joyous life to all forms. Her rare blend of meltingly true vocals and towering romanticism combine with an astute and pragmatic nature to make her a unique and powerful figure in contemporary music. With 10 critically acclaimed solo albums, and awards in tow, Eddi continues to delight audiences worldwide. The past few years have proved to be some of her busiest yet, playing sell out shows as part of her ‘40 Years Live Tour’ in addition to appearing as special guest with the Jools Holland’s Rhythm & Blues Orchestra for an extensive UK tour.\n\nEddi has also explored the acting profession, through her acclaimed performances as Jolene Jowett in John Byrnes Your Cheatin Heart (BBC Scotland production starring Tilda Swinton). She also appeared as a 1937 jazz singer in Richard Linklaters movie: Orson And Me, starring Zac Ephron and in her contribution as Joy 3 in Michael Boyd’s production of Janice Galloway’s The Trick Is To Keep Breathing, (Radio Four and a Tron theatre production also starring Siobhan Redmond and Jenny Black).",
    "date_start": "2026-04-18T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/530157/Eddi-Reader-2025_1920x1005-©-Genevieve-Stevenson_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=FEA010F9-90A2-4F3A-8FE9-468CCEE154C9&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sat 18 Apr at 7:30"
    ]
  },
  {
    "title": "Starstruck",
    "description": "Gene Kelly’s multifaceted brilliance as an entertainer has delighted generations of movie-lovers, and his pioneering choreography has influenced generations of dance-makers. We honour his creative legacy with Starstruck, returning to the stage in 2026 enhanced and extended. Think of it as the director’s cut.\n\nFrom Olympus to Hollywood and Paris, dancers, screen legends and Greek gods are starstruck by love as mythology meets backstage drama, with the sparkling Jazz Age music of George Gershwin and Maurice Ravel performed by the Scottish Ballet Orchestra.\n\nIn collaboration with Gene Kelly’s widow, Patricia Ward Kelly, Scottish Ballet lovingly revived the original ballet in 2021, adding a delightful new twist, and wowing audiences and critics alike.\n\nIn this new two-act Starstruck, CEO/Artistic Director, Christopher Hampson CBE, builds on a love story that mirrors the worlds of gods and mortals, juxtaposing the romantic tensions between a Star Ballerina and a Choreographer, and their mythological counterparts, Aphrodite and Zeus.\n\nPrepare to be transported into a glamorous world where jazz meets ballet, and the stars align!",
    "date_start": "2026-04-24T18:30:00+01:00",
    "date_end": "2026-04-25T20:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/515507/Starstruck25_Inverness-2500x1500_4245e8a3ca02834393b1a8a5382087e8.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=0D66FCB1-691B-4882-AEA5-4EEC5EC02F68&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Film",
    "raw_showtimes": [
      "Fri 24 Apr at 6:30",
      "Fri 24 Apr at 7:30",
      "Sat 25 Apr at 2:30",
      "Sat 25 Apr at 7:30"
    ]
  },
  {
    "title": "The High Life",
    "description": "The High LifeThe MusicalStill Living it!\n\nStory, Script and Lyrics by Alan Cumming, Forbes Masson and Johnny McKnightMusic by Forbes Masson, additional music by Alan CummingDirected by Andrew Panton\n\nAfter a 30-year delay in the departure lounge, The High Life returns in a new musical spectacular featuring all four original cast members - Alan Cumming, Forbes Masson, Siobhan Redmond and Patrick Ryecart.\n\nOh dearie me! Air Scotia has been sold, and unless our intrepid cabin crew can prove they’re still fit for purpose it looks like the future destination for Air Scotia is the scrap heap. In this flight for their lives, our cut-price cabin crew must get themselves (and their passengers) to their destination safely, testing their mettle and putting decades old friendships and rivalries finally to rest.\n\nBased on the original much loved BBC Scotland cult comedy series, this revival sees our iconic characters finding themselves growing older in an ever-changing world. It’s wickedly funny, features new and original music, is stuffed full of camp silliness and is cleared for take-off.\n\nSigned- British Sign Language interpretation of the spoken and artistic content.\n\nCaptions- Live text of the spoken word and sound effects on stage.",
    "date_start": "2026-04-29T19:30:00+01:00",
    "date_end": "2026-05-02T20:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/518923/High-Life-Final-72dpi_6b51984a2a9d23ece22f88d55f9b6803.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=467BBE65-E898-4127-B238-5877965423CC&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Musicals",
    "raw_showtimes": [
      "Wed 29 Apr at 7:30",
      "Thu 30 Apr at 2:30",
      "Thu 30 Apr at 7:30",
      "Fri 1 May at 7:30",
      "Sat 2 May at 1:30",
      "Sat 2 May at 2:30",
      "Sat 2 May at 7:30"
    ]
  },
  {
    "title": "General Medical Emergency Ward 10",
    "description": "The award-winning Dyad Productions and Company Gavin Robertson are joining forces!\n\nIt’s a pedigree of the first degree! Between them, Dyad’s recent productions – Austen’s Women: LADY SUSAN, A Christmas Carol, A Room of One’s Own, That Knave, Raleigh - and Gavin Robertson, with Done to Death by Jove!, The Ghost of a Smile and BOND - An Unauthorised Parody have toured both the UK and internationally, with resounding success over the last few years. Labouring away in secret, looking for the perfect co-production has taken time, but finally the answer has arrived!\n\nEvery hospital, medical-based, Doctors-and-Nurses cliche-ridden drama onstage in a comedy mash-up spoof!\n\nIt'll have you in stitches!\n\nIt’s Dr Ann Fleming’s first day at St David’s, where her unfortunately-named mentor Dr Death, is determined to show her who’s boss. As medical emergencies overload the hapless staff, Dr Fleming has to juggle a complicated budding love affair, with a kidney, and a nosey Hospital boss. Not literally.\n\nYes – ‘Holby City’, ‘Casualty’, ‘E.R’ and ‘Doctors’ - not to mention movies galore, are re-imagined and invigorated by Rebecca Vaughan, Andrew Margerison and Gavin Robertson in a pacy, cliché-ridden comic homage to the intrigues and dramas of every hospital plotline on the big and small screen!\n\nTo be taken once a day. (Or twice if there’s a matinee).\n\nCreated in collaboration with the Old Town Hall, Hemel Hempstead.\n\n★★★★★ ‘If you haven’t seen Dyad Productions’ work before, you simply must’ British Theatre Guide\n\n★★★★★’Robertson performs with a subtle conviction that’s compelling to watch’ The Guardian",
    "date_start": "2026-04-30T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/537255/General-Medical-Emergency-Ward-10_b2946f86e66e0ad911c6254e963e6c35.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=8EE8F04F-3947-467C-8717-33EEED7ACCAA&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Thu 30 Apr at 8:00"
    ]
  },
  {
    "title": "Josh Widdicombe: Not My Cup of Tea",
    "description": "Josh Widdicombe is back on tour, not again! By now he has almost certainly mastered the art of stand-up, either that or he has wasted the last 15 years of his life. Come along and decide for yourself. Expect it to be shorter and with lower production values than Taylor Swift’s Eras Tour, but funnier and with more references to tea.\n\nJosh co-hosts the hugely popular podcast Parenting Hell with Rob Beckett, which has somehow become so popular that they undertook a live arena tour in 2023 and released a book which topped the Sunday Times Bestseller Charts. He’s co-hosted in over 30 series of the multi-award-winning Channel 4 series The Last Leg, is a team captain on Sky Max’s Rob Beckett’s Smart TV and co-hosts Sky’s Hold The Front Page. And he has an almost complete collection of Panini football sticker books.\n\nSave money with Eden Court Friends.",
    "date_start": "2026-05-04T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/413417/JW_NotMyCupOfTea_1920x1080_PLAIN_b5c64ede9a74bf759b41892fe9c4d96d.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=3767728A-9BD7-4909-8BA8-A566B3DE3DA0&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Mon 4 May at 7:30"
    ]
  },
  {
    "title": "An Evening with Barbara Dickson",
    "description": "Barbara Dickson has enjoyed a glittering 50-year career in music and theatre, which includes her string of top-10 hits in the late 70s and 1980s. Come and hear her in conversation with Graham Spiers and enjoy a song or two as well. Music and faith have become central to Barbara’s life, as she will no doubt explain. This event will include audience Q&A and promises to be a very enjoyable evening. And don't forget Barbara and The Two Ronnies…",
    "date_start": "2026-05-05T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567405/Barbara-Dickcon_475d8d31d85759c1b9656778fd9e1485.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=3772E68C-CB6C-4A82-8D52-496AF1841FA3&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Talks / Special Events",
    "raw_showtimes": [
      "Tue 5 May at 7:30"
    ]
  },
  {
    "title": "Windblown",
    "description": "By Karine Polwart\n\nA hauntingly beautiful tribute to a palm tree facing its chainsaw demise, Windblown is a spellbinding blend of folk music, conjured sound, intimate storytelling and stunning, immersive visuals.\n\nStep into a world of song, story and stillness with this exquisite, theatrical ‘parting glass’ to a 200-year-old Sabal palm brought from Bermuda to Scotland in the early 1800s, and to the gardeners who loved it.\n\nBeneath a mesmerising canopy of sculpted fronds, accompanied live by pianist Dave Milligan, Polwart gives voice to the palm itself, tracing its extraordinary life and final days; exploring themes of colonial legacy, ecological care, grief and resilience.\n\nWindblown is a deeply moving, luminous production that provoked a powerful emotional response in audiences at the Edinburgh Festival Fringe in 2025, receiving five-star reviews across the board. Join us for this unforgettable meditation on our connection to the natural world and the quiet, enduring acts of love that sustain it.\n\nSupported by Creative Scotland",
    "date_start": "2026-05-06T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/546683/Windblown2500x1500EC_f425b1ff47ec88d58e61582fac487432.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=F866F4A1-8572-4B8B-9EC7-0D5D95C8414C&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 6 May at 7:30"
    ]
  },
  {
    "title": "In The Air Tonight",
    "description": "Get ready for a Night to Remember – as we bring the unforgettable sound of Phil Collins to life!\n\nThis is IN THE AIR TONIGHT - the ultimate live tribute to the one and only Phil Collins.\n\nFrom the epic drum breaks to the soul-stirring ballads, this show brings the sound of a generation roaring back to life. Relive the magic of Phil’s greatest moments – from his Genesis roots to his incredible solo career - in a concert that will have you singing, swaying, and dancing all night long.\n\nStarring an electrifying live band, powerhouse vocals, and a stellar cast of musicians, In The Air Tonight captures the unmistakable energy, emotion, and drive of Phil Collins like never before.\n\nFeaturing all the classics, including:“You Can’t Hurry Love,” “Take Me Home,” “I Wish It Would Rain Down,” “One More Night,” and the explosive “In the Air Tonight” - with that drum solo performed live and louder than ever.\n\nDon’t miss your chance to experience the sound, the soul, and the sheer brilliance of Phil Collins - live on stage!",
    "date_start": "2026-05-09T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567407/In-The-Air-Tonight-SuperLandscape-entertainers_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=DE0F634E-D355-433E-BB56-AFD5C8FA741C&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sat 9 May at 7:30"
    ]
  },
  {
    "title": "Cruinn Còmhla: Acoustic Gaelic Night with Sgo",
    "description": "Thig còmhla rinn airson oidhche shònraichte de cheòl aig Cruinn Còmhla anns an t-seipeal còmhla ri Sgo. ’S e com-pàirteachas ciùil a th’ ann an Sgo eadar na peathraichean Steaph agus Ciorstaidh Chaimbeul, às an Eilean Sgitheanach bho thùs. Le bogsa-ciùil, clàrsach agus seinn, bidh an ceòl aca a’ tarraing air an àrach agus an dearbh-aithne Ghàidhealach, a’ measgachadh diofar seòrsaichean ciùil, fuaimean agus sgeulachdan.\n\nSgo is a musical partnership between sisters Steaph and Ciorstaidh Chaimbeul, originally from the Isle of Skye, Scotland. The duo explores the expressive capabilities of the harp, accordion, and voice to create original compositions. Their work draws on their Gaelic upbringing and identity, blending chamber music, sound design, and storytelling. Together, they have performed across the UK and internationally, including appearances at Blas Festival, PanCeltic Festival, and HebCelt Festival. They are both currently based in Copenhagen, Denmark.\n\nSgo will perform music from their upcoming debut album, which explores the ogham alphabet and its symbolism in Gaelic Culture.\n\nWith thanks to Maoin nan Ealan Gàidhlig and Chamber Music Scotland.\n\nPlease be aware capacity is very limited in our chapel.",
    "date_start": "2026-05-11T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567391/2_Sgo_Image-Credit-Jonny-Ashworth_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=32E34306-5A15-4290-A70D-FF352ABFED42&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Mon 11 May at 7:30"
    ]
  },
  {
    "title": "Sunny Afternoon",
    "description": "Following two phenomenal years in London’s West End and a sensational first UK and Ireland tour, the “indisputably terrific” ★★★★ (The Times) OLIVIER AWARD-WINNING BEST NEW MUSICAL – SUNNY AFTERNOON – is back!\n\nSunny Afternoon is a story of friendship, fame and rock history, set to a soundtrack of era-defining songs that brings the sound of the 60s roaring back to life. Experience the electrifying true story behind The Kinks, the band that changed rock music forever, with a back catalogue of unforgettable hits including You Really Got Me, Lola and All Day and All of the Night.\n\nStepping into the band's legendary shoes are Danny Horn (Ray Davies), Oliver Hoare (Dave Davies), Harry Curley (Peter Quaife) and Zakarie Stokes (Mick Avory) — capturing the spirit, sound, and swagger of one of the most influential bands of the British Invasion.\n\nWith music and lyrics by the legendary Ray Davies, a book by Joe Penhall, original story by Ray Davies and direction by Edward Hall, Sunny Afternoon is a thrilling celebration of rock ‘n’ roll, rebellion and the anthems that still move us today.",
    "date_start": "2026-05-12T19:30:00+01:00",
    "date_end": "2026-05-16T20:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/560103/SUNAFTT25_Q3_022_NewSocialAssets_KeyArt_1920x1080_V2_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=352CEBD0-D1A7-4220-9923-D53B1D5A884E&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Musicals",
    "raw_showtimes": [
      "Tue 12 May at 7:30",
      "Wed 13 May at 7:30",
      "Thu 14 May at 2:30",
      "Thu 14 May at 7:30",
      "Fri 15 May at 7:30",
      "Sat 16 May at 2:30",
      "Sat 16 May at 7:30"
    ]
  },
  {
    "title": "Tom Stade - Naughty By Nature",
    "description": "Direct from the Edinburgh festival, and his last smash-hit nationwide tour,\n\nThe legendary Canadian stand-up star is back on the road with a brand-new show.\n\nJoin Tom as he playfully dishes out more of his insightful observations. An irrepressible tour-de-force with an hour of first class, mischievous and uncompromising comedy.\n\nAs seen/heard on Have a Word Pod, Ch4’s Comedy Gala, Michael McIntyre’s Comedy Roadshow, The John Bishop Show, Live at the Apollo (so good, he’s done it twice) and much more!\n\nwww.tomstade.com",
    "date_start": "2026-05-14T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/496893/Tom-Stade-Tour-2025-FacebookBanner_158e093c4c7853930abea9dd4b9acd67.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=CF56241D-DEE1-48F9-BAF0-6F15A1909836&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Thu 14 May at 8:00"
    ]
  },
  {
    "title": "NEIL BRAND's 'Centenary Laurel & Hardy Show'",
    "description": "Following the success of his 2023/24 tour, Neil Brand invites you to celebrate the centenary of Laurel and Hardy with a brand-new show. In 1926, Stan Laurel and Oliver Hardy signed separate contracts with Hollywood film mogul Hal Roach, and appeared for the first time in a film together, \"45 Minutes from Hollywood\". The following year they would become an official comedy partnership that would set the whole world rocking with laughter. Nobody could have anticipated at the time how this unlikely Anglo/American comedy duo would become global icons in over 130 countries around the world.\n\nWe are pleased to announce and celebrate those 100 years with the brand new production of Neil Brand’s “Evening with Laurel & Hardy” 2026 Centenary Tour. Neil has established himself as the foremost exponent of silent film and improvised piano accompaniment.\n\nThanks to new restorations of their silent films, and the rediscovery of some of their lesser-known comedies, Neil will uncover gems of hilarity from the team whose comedy never ages, and bring them to jaw-dropping life with the demanding live piano improvisations for which he is so famous. Featuring extended scenes from the best of their silent comedies, particularly You're Darn Tootin, The Finishing Touch and The Second Hundred Years.\n\nNeil’s concerts have proved really popular with his personal contact with the audience & his unique insight into Laurel & Hardy and the birth of the cinema industry. His engaging easy-going style, along with his Q&A at the end of the show answering all the questions from the audience, followed by his after-show ‘Meet and Greet’, makes for a highly entertaining evening.\n\nCurrently working on a television documentary and a new book about 'The Boys', Neil is once again looking forward to sharing his knowledge and expertise with audiences around the country, and celebrating the life and times of comedy legends, Stan Laurel & Oliver Hardy.",
    "date_start": "2026-05-15T19:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/535823/LAURELHARDY_100-YEAR-VISUALS-FINAL-01.05.25-THEATRE-AD4_8d268dcd962873bc86c9b1e2459f67df.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=5C00EB56-2FB6-4879-B308-9AEA11A1AAA9&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 15 May at 7:00"
    ]
  },
  {
    "title": "An Acoustic Evening with Wet Wet Wet",
    "description": "Wet Wet Wet have announced a UK acoustic tour of intimate shows where the majority of venues are located in places that they’ve never played before during their 40+ year career; as well as a brand new album that sees them revisit their songs in a stripped back style.\n\n‘An Intimate Acoustic Evening with Wet Wet Wet’ will see founding member Graeme Clark, long -standing guitarist Graeme Duffin, and lead singer Kevin Simm, who joined the band in 2018, perform a full set of reworked Wet Wet Wet classics, with the odd story and anecdote from the band’s history thrown in for good measure.\n\nFor those who want an extra-special experience, VIP tickets are available, offering a meet-and-greet with Wet Wet Wet. But hurry—these are limited.",
    "date_start": "2026-05-19T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/522037/WWW-Acoustic-2026_Ticketmaster_2426x1365_6f7de2b97fbd2054f22b4482a14b3200.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=C4833F50-953C-4A50-A9C1-83BF29EB5B76&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Tue 19 May at 7:30"
    ]
  },
  {
    "title": "The Drifters In Concert",
    "description": "The Drifters are back on tour in the UK performing all their classic hits including ‘Saturday Night at the Movies', ‘You’re More Than A Number,’ ‘Come on Over to My Place’, ‘Under the Boardwalk’, ‘Kissin’ In The Back Row’ and many more!\n\nThe legendary group have been inducted into the Rock & Roll Hall of Fame, performed for the President of the United States and listed among the Greatest Artists of All Time by Rolling Stone magazine.\n\nUnder the guidance of Tina Treadwell (daughter of the group’s original founders, George & Faye Treadwell) The Drifters have enjoyed a remarkable resurgence in recent years with multiple successful UK tours including headline shows in major arenas and, most notably, the world famous Royal Albert Hall in London for the first ever time in the group’s glittering career. “I am thrilled with the success of our recent UK tours and we invite you all to join us in continuing to celebrate this incredible and everlasting story of The Drifters.” Said Tina, speaking about the tour.",
    "date_start": "2026-05-20T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/537185/Main-Image-logo_d885c347bf32e4b83d519a6ac47d6f9d.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=48569E42-738A-47BC-9C40-4753BF377C69&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 20 May at 7:30"
    ]
  },
  {
    "title": "RUMOURS OF FLEETWOOD MAC 2026",
    "description": "Personally endorsed by Fleetwood Mac founding member, Mick Fleetwood, Rumours of Fleetwood Mac is the ultimate tribute to one of rock and roll’s most remarkable groups.\n\nChanneling the spirit of Fleetwood Mac at their very best, Rumours of Fleetwood Mac offers a unique opportunity for fans, both old and new, to rediscover the songs and performances that have ensured Fleetwood Mac’s place as one of the most loved groups of all time.",
    "date_start": "2026-05-21T19:30:00+01:00",
    "date_end": "2026-05-22T20:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/537189/RFM_1920x1080_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=2A0A8100-6AD6-4CF2-8E2E-64B083F746C0&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 21 May at 7:30",
      "Fri 22 May at 7:30"
    ]
  },
  {
    "title": "The Tumbling Paddies",
    "description": "The Tumbling Paddies are a musical force born from friendship, roots, and a shared love of Irish music. From the scenic heartlands of County Fermanagh, this six-piece band have risen from local pub sessions to become one of Ireland’s most exhilarating live acts — blending the timeless soul of trad with the vibrancy of modern pop and country.\n\nFormed in 2014, the band’s journey began modestly, playing weddings and small town gigs for fun. But what set them apart was their infectious energy and undeniable chemistry. After meeting manager Andrew Cox following a show in Belleek, their focus sharpened. Together they began to record original material, crafting a signature sound defined by driving rhythms, melodic banjo and fiddle lines, and heartfelt lyrics that speak to life, love, and Irish pride.\n\nTheir debut album, The Way We Are, was a defining moment — a confident blend of tradition and originality. The standout single “The Way I Am” spent over ten weeks at the top of the independent Irish charts, introducing their music to a much wider audience.\n\nSince then, their live reputation has skyrocketed. The Journey So Far – Live captures the energy of their shows — packed houses singing, dancing, and celebrating in unison. Tours across Ireland, the UK, Europe, and beyond have turned The Tumbling Paddies into ambassadors for a new era of Irish music: joyful, contemporary, and full of heart.\n\nNow commanding stages like Dublin’s 3Olympia Theatre, The Tumbling Paddies continue to prove that tradition is not a relic of the past, but a living, breathing force that evolves with every song and every show.\n\nSupport Act Ruby Rua",
    "date_start": "2026-05-23T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/561277/PHOTO-2025-11-12-21-33-53_8467a66a720daf2c1e8865ff6c0ce4f8.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=07FDF0D3-A003-4202-B788-85049BEBBD65&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sat 23 May at 7:30"
    ]
  },
  {
    "title": "Richard Thompson",
    "description": "Become an Eden Court Friends member to book your tickets from Thu 30 Oct, 10am. Find out more and sign up by clicking here.\n\nGeneral tickets will be released from Fri 31 Oct, 10am.\n\nRichard Thompson’s musical influence cannot be overstated. Having co-founded the ground breaking group Fairport Convention as a teenager in the ‘60s, he and his bandmates invented the distinctive strain of British Folk Rock. He left the group by the age of 21 which was followed by a decade long musical partnership with his then-wife Linda, to over 30 years as a highly successful solo artist.\n\nIn 2011, Thompson received an OBE (Order of the British Empire) personally bestowed upon him by Queen Elizabeth II at Buckingham Palace. The Los Angeles Times called him “the finest rock songwriter after Dylan and the best electric guitarist since Hendrix” and Rolling Stone has named him one of the Top 100 Guitarists of All Time. He has received lifetime achievement awards for songwriting from the BBC Radio 2 Awards, the Americana Music Association, and was awarded the prestigious Ivor Novello Award. His song “1952 Vincent Black Lightning” was named one of TIME Magazine’s “100 Greatest Songs Since 1923.” A wide range of musicians have recorded Thompson’s songs including Robert Plant, Elvis Costello, R.E.M., Sleater-Kinney, Del McCoury, Bonnie Raitt, Tom Jones, David Byrne, Don Henley, Los Lobos, and many more. His massive body of work includes many Grammy nominated albums as well as numerous soundtracks, including Werner Herzog’s Grizzly Man and 2019’s The Cold Blue.\n\nHis genre defying mastery of both acoustic and electric guitar along with engaging energy and onstage wit continue to earn him new fans and a place as one of the most distinctive virtuosos and writers in Folk Rock history. In May 2024 Richard Thompson released to critical acclaim, Ship To Shore, his first studio album in six years.",
    "date_start": "2026-05-27T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/553543/2500-985-Rich-Thompon_afd1853ac727aaf5a35b1cd350d6e4e4.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=CE1A0AF3-472D-48A9-BA6A-32629962A5CD&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 27 May at 7:30"
    ]
  },
  {
    "title": "The Big Comedy Roadshow",
    "description": "A rip-roaring night of the very best live stand-up comedy starring the TV names you know and love alongside some of the hottest up-and-coming talent. Presented by Scotland’s original home of live comedy Gilded Balloon, this is the ultimate night out for comedy fans! “Will make you laugh, a lot, simple as” - British Comedy Guide.\n\nRecent line-ups have included Maisie Adam, Larry Dean, Sarah Keyworth, Felicity Ward, Kiri Pritchard-McLean, and Jen Brister. 2026 line-up to be announced soon.\n\n*Line-up is subject to change in exceptional circumstances. In the event of a line-up alteration, a performer of similar calibre will be added.",
    "date_start": "2026-05-28T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/562659/BCRS-Generic-Gfx-16-9_5ed56d4977417f996a07f7e1444d4767.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=80ADFC7E-A71D-4A4B-93BD-FA8240A1D6BD&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Thu 28 May at 8:00"
    ]
  },
  {
    "title": "After All",
    "description": "After All is a show about death. It is a celebration of our vulnerable and courageous existence using dance, theatre, storytelling and comedy to ask: how do we deal with the end?\n\nBy exploring various funeral rites - ones we have, ones we have lost, and those yet to be invented - choreographer Solène Weinachter confronts our transition between worlds head-on. After All is a hopeful attempt to conjure a better sort of space for us to be with loss and collectively contemplate the finite nature of our lives.",
    "date_start": "2026-05-29T19:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/526757/AFTER-ALL-by-Solene-Weinachter-credit-Genevieve-Reeves-5_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=A7130838-749B-4B4A-A039-BE4069C193A2&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Dance",
    "raw_showtimes": [
      "Fri 29 May at 7:00"
    ]
  },
  {
    "title": "Showstopper! The Improvised Musical",
    "description": "Spontaneous musical comedy at its absolute finest – direct from the West End and now heading to Eden Court!\n\nWith fifteen years as an Edinburgh Fringe must-see phenomenon, a BBC Radio 4 series, a critically acclaimed West End run and an Olivier Award to their name, The Showstoppers have delighted audiences across the globe with their ingenious blend of comedy, musical theatre and spontaneity.\n\nA brand new musical comedy is created from scratch at each performance of this award-winning show as audience suggestions are transformed on the spot into all-singing, all dancing productions with hilarious results.\n\nThese incredible performers are guaranteed to impress as they create shows packed with drama, dazzling dance routines and catchy melodies – and it's all made up on the spot!\n\nSo whether you fancy Hamilton in a hospital, Sondheim in the Sahara or Idina Menzel in Inverness, you suggest it and The Showstoppers will sing it!",
    "date_start": "2026-05-29T19:30:00+01:00",
    "date_end": "2026-05-30T20:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/565255/ST-Key-Art-1920-x-1080-RGB_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=E93D50B0-EC84-4AA4-846B-496B729AA798&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Musicals",
    "raw_showtimes": [
      "Fri 29 May at 7:30",
      "Sat 30 May at 7:30"
    ]
  },
  {
    "title": "Ivo Graham: Orange Crush",
    "description": "What is the best orange thing in the world? Aperol spritz? Sunsets? Claudia Winkleman? You probably never stopped to think about what your favourite orange thing was, but you’re damn sure thinking about it now. Maybe it’s marmalade, or maybe it’s Garfield, or maybe it’s the album 'Channel Orange’ by Frank Ocean. There’s just so many to consider. And no one on earth has considered more of them than Ivo Graham.\n\nIvo Graham has always been a fan of orange things. Baked beans. Sriracha mayo. The Tiger Who Came To Tea. But in 2025, a series of emotional days in his favourite colour prompted Ivo to commit harder than ever to the bit: colour-coordinating his life for his daughter, for his mother, for his football team, and, he desperately hopes, for your entertainment. Come and help this orange lunatic make his orange list, in a show about hats, haters, hometown heroes, and whether Hare Krishnas are better than Hobnobs.",
    "date_start": "2026-05-30T19:45:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/564071/IG-OC-2000X1000-TT-V02_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=A660B648-85DE-4F95-A746-9573FBAFA2F6&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 30 May at 7:45"
    ]
  },
  {
    "title": "The Simon & Garfunkel Story",
    "description": "Few shows have experienced the phenomenal global success of The Simon & Garfunkel Story, with multiple sold-out shows in over 50-countries worldwide and over 20 headline performances in London’s West End, including multiple appearances at the world-famous London Palladium.\n\nUsing huge projection photos and original film footage, the international hit show tells the story of the origins and meteoric rise of Simon & Garfunkel blended together seamlessly with a full live band performing all the hits including Mrs Robinson, Cecilia, Bridge Over Troubled Water, Homeward Bound and many more.\n\nWith standing ovations at every performance at the show Art Garfunkel himself loved, you don't want to miss this international sensation.",
    "date_start": "2026-05-31T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/545937/1920x1080_251007_114230_1c1a8f1b9a58371f4e143d86af9f759f.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=1CEEE94D-CAC8-481C-80EC-C5811CAB8941&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sun 31 May at 7:30"
    ]
  },
  {
    "title": "Gnoss",
    "description": "Gnoss’ signature sound is a rich tapestry of acoustic layers; outstanding musicianship, deep traditional roots and contemporary compositional flair combine to create songs and tunes brimming with character.\n\nTriple Scots Trad Music Awards nominees, the band have built an invested following through their forward-thinking take on traditional music and the unique warmth of their live shows. This has been proven through three consecutive sellout appearances at Glasgow’s world-famous Celtic Connections festival.\n\nTheir 2019 release, Drawn From Deep Water was met with widespread praise (“a refreshing blast” - RnR) for its exemplary interplay, nakedly emotional playing, and well chosen material. The 11-track album brought Gnoss to entranced audiences across France, Italy and Denmark, not to mention the length and breadth of the UK.\n\nTheir follow up album, The Light of The Moon continued to demonstrate Gnoss’ dedication to their craft that places them firmly at the fore of what’s happening in Scottish folk and earned them a nomination for Album of the Year at the Scots Trad Music Awards. Described as “an invigorating new direction for the Gnoss boys” by Songlines, this album took Gnoss’ online fanbase by storm gaining over one million streams in 2022.\n\nWith the release of their third album, 2023’s Stretching Skyward, Gnoss reignite their collaboration with producer and engineer, Scott Wood\n\n(Skerryvore), further exploring their acoustic roots whilst incorporating new, electronic elements. Launch dates include performances across the UK and Europe, including standout appearances at the Orkney Folk Festival, Cambridge Folk Festival, Towersey Festival and Denmark’s Tønder Festival.\n\nGnoss combines the talents of;\n\nAidan Moodie (Guitar/Vocals)\n\nGraham Rorie (Fiddle/Mandolin/Electric Tenor Guitar)\n\nConnor Sinclair (Flute/Whistles/Vocals)\n\nCraig Baxter (Bodhran/Percussion)",
    "date_start": "2026-05-31T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567425/Promo-2-Stretching-Skyward-Gnoss-Elly-Lucas_7ac2075e8fe832fef1f37454cd5a5019.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=FE3491E8-6477-49D6-8278-C50785957333&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sun 31 May at 8:00"
    ]
  },
  {
    "title": "STAND & DELIVER: THE LEE JEANS SIT-IN",
    "description": "Written by Frances Poet\n\nDirected by Jemima Levick\n\nFrom an idea conceived by Paul English and Frances Poet.\n\n‘In a factory like this, you’re part of a team. You’re a family.’\n\nGreenock 1981.\n\nFaced with the threat of their factory closing, and with 240 jobs on the line, there’s no way the women of the Lee Jeans factory are going down without a fight.\n\nThey barricade the doors, take a stand against corporate greed and stage a sit-in that lasts for 7 long months.\n\nDeveloped in conversation with some of the key women involved in the strike, this new play is full of authentic details that bring this significant moment in Scottish history to life.\n\nPlayed out to a live 80’s soundtrack, this is the true story of the gallus Greenock girls who fought a battle against injustice that thrust them onto the world stage.\n\nCaptions- Live text of the spoken word and sound effects on stage.\n\nSigned- British Sign Language interpretation of the spoken and artistic content.",
    "date_start": "2026-06-02T19:00:00+01:00",
    "date_end": "2026-06-03T20:00:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/562665/StandDeliver-Lee_8c9a7c85a713858dbdc594e9ccb17a74.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=A9B57620-6C0F-4DF6-B87E-4430E666358B&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Musicals",
    "raw_showtimes": [
      "Tue 2 Jun at 7:00",
      "Wed 3 Jun at 7:00"
    ]
  },
  {
    "title": "Danny Bhoy: Dear World…",
    "description": "Danny Bhoy brings his sellout London, Edinburgh & Montreal Comedy Festival 2025 show, Dear World, to venues across the UK.\n\nThis is the sequel to my 2014 show ‘Dear Epson…’ My favourite ever show. It’s a hybrid of stand up and theatre, but really that just means I get to sit down for bits of it.",
    "date_start": "2026-06-03T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/559125/Danny-Bhoy-1920x1080_a92dd78dcd833f2c06931b76fa7fc4d5.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=BCDBC9AA-62A8-42E8-96CC-C778AC252CFB&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Wed 3 Jun at 8:00"
    ]
  },
  {
    "title": "An Evening with Julie Fowlis",
    "description": "Join Julie and her stellar band for a special evening of music and song, celebrating 21 years since the release of her debut album Mar a Tha Mo Chridhe (As My Heart Is). A captivating blend of traditional Gaelic music and contemporary style, and a rare opportunity to see Julie perform live in Scotland.",
    "date_start": "2026-06-05T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/559151/Julie-Fowlis-111125-Poster-photo-1_0a5f8a1ebf47d7ef7682d4490d5ec2f6.jpeg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=53462E66-6BB2-4D24-B5DA-3D5D2A53449A&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 5 Jun at 7:30"
    ]
  },
  {
    "title": "Coldplace",
    "description": "COLDPLACE - The World's Leading Tribute to Coldplay is a stunning live concert performance, celebrating the music of one of the most successful bands of all time.\n\nThe only tribute to have worked for Coldplay, this outstanding band leads you through all your favourite Coldplay hits from the last 20+ years including Yellow, Paradise and A Sky full of Stars, right through to Higher Power and My Universe from their latest album, Music of the Spheres.\n\nThis world class show faithfully recreates the magic of Coldplay's record breaking live tours - featuring lasers, confetti, video screen and the Xyloband LED wristbands that have become synonymous with Coldplay concerts, and truly make the audience part of the show.",
    "date_start": "2026-06-10T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/529323/COLDPLACE-2025_3f3e1bc401aa1f84771ec885f1c36556.jpeg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=A441501D-9A1B-4077-B737-D42F5B22FC80&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 10 Jun at 7:30"
    ]
  },
  {
    "title": "Paul Black – Cash Cow",
    "description": "Scottish Comedy Agency presents\n\nPaul Black – Cash Cow\n\nCash Cow marks Paul’s return to stand-up after his sell-out sketch show All Sorts. In this new show Paul delivers his trademark mix of sharp observations, colourful characters, impressions and Glaswegian charm.\n\nSir Billy Connolly Spirit of Glasgow Award Nominee 2023 & 2025. RTS Scotland Comedy Award Nominee 2023",
    "date_start": "2026-06-13T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/565391/Paul-Black-Cash-Cow-2026_cf929c44f8eec27874a92a34304ecac1.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=AABF5E84-2362-4311-A69D-5EA24C76E198&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 13 Jun at 7:30"
    ]
  },
  {
    "title": "When Toys Come to Life",
    "description": "When Toys Come to Life Presented by the youngest stars of TFX Performing Arts Academy Get ready to be swept into a world where imagination takes centre stage and every toy has a story to sing! Join us as dolls, teddies, action figures, and more share their enchanting tales on stage in a celebration of imagination, friendship, and the magic that lives inside every toy. The youngest talents of TFX Performing Arts Academy bring the magic of the toy box alive with enchanting melodies, joyful dance numbers, and heart-warming moments that will delight audiences of all ages. This musical adventure captures the wonder of childhood and the joy of make-believe.\n\nA sparkling celebration of creativity, courage, and the power of play — this is family theatre at its most magical where our most loved toys tell their tales!",
    "date_start": "2026-06-14T11:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567429/When-Toys-come-to-Life-2026-A4-2500-x-985-px_e7c7a2f19878a250e657a4e55d2464d1.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=7C60C82C-0CCF-4A90-9067-49D0B147F608&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Local / Showcase",
    "raw_showtimes": [
      "Sun 14 Jun at 11:00"
    ]
  },
  {
    "title": "Magic at the Movies",
    "description": "Performed by the students of TFX Performing Arts Academy Lights… camera… magic! TFX’s older students take centre stage in a spectacular celebration of the stories we’ve all fallen in love with — the ones so iconic, so timeless, that they shine just as brightly on the big screen as they do in live theatre. Magic at the Movies is an exhilarating, all-singing, all-dancing tribute to the greatest movie musicals of all time. From sweeping showstoppers to heart-racing ensemble numbers, this production brings cinematic favourites to life with vibrant choreography, powerful vocals, and that unmistakable TFX energy. Join us for an unforgettable journey through the silver screen’s most beloved tales, reimagined with passion, polish, and pure theatrical joy. A blockbuster family experience — where every number is a showstopper and every moment is filled with movie magic.",
    "date_start": "2026-06-14T18:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567427/Magic-at-the-Movies-2026-show-2500-x-985-px_afd1853ac727aaf5a35b1cd350d6e4e4.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=F9484D22-B59A-4093-95B6-EAD50C5CE31F&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Local / Showcase",
    "raw_showtimes": [
      "Sun 14 Jun at 6:30"
    ]
  },
  {
    "title": "The Marriage of Figaro",
    "description": "Sir Thomas Allen revives his much-loved production of Mozart’s unstoppable masterpiece. Reflecting the insight and experience of a seasoned performer, Allen’s Figaro is full of humour, subtlety, and wit. Simon Higlett’s sumptuous designs provide the backdrop for a comedy of social revolution and subversion that is as relevant today as ever, and this time sung in English.\n\nAll wedding days are complicated, but nothing compared to Figaro’s. After discovering that his boss, the Count, plots to seduce his wife, Figaro and Susanna must use their wit to outsmart their employer, whilst making it down the aisle.\n\nMozart’s bubbling, energetic score – conducted by Dane Lam shows his true theatrical genius for getting to the heart of each character. Edward Jowle is Figaro, with Ava Dodd as Susanna. The main cast is rounded out by Ian Rucker making his Company debut as Count Almaviva, Alexandra Lowe as the Countess, and Simone McIntosh as Cherubino.\n\nRevival of the 2010 production\n\nLanguage: Sung in English with English supertitlesTranslation by Amanda Holden\n\nWe are delighted to have some complimentary tickets available for each performance for school groups. To access these, please contact Morag Russell, Engagement Programme Co-ordinator, on [email protected]\n\nCreatives:\n\nConductorDane Lam\n\nDirectorSir Thomas Allen\n\nDesignerSimon Higlett\n\nLighting DesignerMark Jonathan\n\nChoreographerKally Lloyd-Jones\n\nThe Orchestra of Scottish Opera\n\nThe Chorus of The Marriage of Figaro\n\nCast:\n\nFigaroEdward Jowle\n\nSusannaAva Dodd\n\nCount AlmavivaIan Rucker\n\nCountess AlmavivaAlexandra Lowe\n\nCherubinoSimone McIntosh\n\nDoctor BartoloEdward Hawkins\n\nDon Basilio / Don CurioLuvo Maranti\n\nMarcellinaJeni Bern\n\nAntonioFrancis Church\n\nTouch Tour - They are behind the scenes tours in order for visually impaired patrons to walk on the set, feel costumes and props, and get an account of where these things appear in the show, and their relevance to the story. Tours are free of charge but are specifically for visually impaired patrons and their companions.",
    "date_start": "2026-06-18T19:15:00+01:00",
    "date_end": "2026-06-20T20:15:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/508785/The-Marriage-of-Figaro-Website-Image-Eden-Court-Inverness-2500x1500px_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=5EB76660-3057-460B-B442-38A53976F980&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Opera",
    "raw_showtimes": [
      "Thu 18 Jun at 7:15",
      "Sat 20 Jun at 6:00",
      "Sat 20 Jun at 6:00",
      "Sat 20 Jun at 7:15"
    ]
  },
  {
    "title": "Moving Pictures - RUSH Tribute",
    "description": "MOVING PICTURES is one of the hardest working bands on the planet, constantly touring the UK, Europe, Brazil and Canada including Lakeside Park for Neil Peart's family and Massey Hall for RUSHfest Canada in August 2025.\n\n2026 celebrates 50 years of RUSH’s 2112 album.\n\nTonight's return to Eden Court sees MOVING PICTURES play the 2112 suite in full as well as songs from every RUSH era.\n\nWhether you're a die-hard Rush fan or simply appreciate great live music, don't miss your chance to experience the magic of Moving Pictures in person.",
    "date_start": "2026-06-26T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/553811/MOVING-PICTURES-2026-band-2500-x-985-px_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=B8AF7443-A7A0-4CDE-855F-4D236BB282E4&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 26 Jun at 7:30"
    ]
  },
  {
    "title": "Tom Gates Epic Stage Show",
    "description": "Based on the bestselling books by Liz Pichon, and brand new for 2025, Tom Gates EPIC Stage Show comes to our theatre bringing alive the illustrations and music that makes Tom Gates hugely popular around the world! With catchy tunes and hilarious performances, this fantastic new stage show brings the best of the Brilliant World of Tom Gates into one live show!",
    "date_start": "2026-06-27T12:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567435/TomGateslandscape_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=51A940E7-1B75-405E-8DD3-F71D146DC6A4&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Family",
    "raw_showtimes": [
      "Sat 27 Jun at 12:30",
      "Sat 27 Jun at 3:30"
    ]
  },
  {
    "title": "Burn the Floor: Nikita Kuzmin – Supernova",
    "description": "Strictly Come Dancing finalist and fan favourite Nikita Kuzmin takes centre stage in the explosive new dance spectacular Supernova, touring the UK in June and July 2026.\n\nCreated in collaboration with world-renowned choreographer and BAFTA award recipient Jason Gilkison and presented by international dance sensation Burn the Floor. Supernova is a show fuelled by the firepower of world class performers and creatives from around the world.\n\nExpect an evening of electrifying entertainment where artistry meets innovation, and Nikita’s trademark charm, power and charisma shine brighter than ever.\n\nGet ready — the Supernova is about to explode!\n\nMeet + Greet\n\nMeet + Greet tickets include a pre-show meet and greet (5pm) with Nikita to get autographs and a picture with the star, and some exclusive show merchandise to take home.",
    "date_start": "2026-07-08T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/538215/BTF-Nikita-Brighton-onsale-1920x1080_1ac86feddfe8dce29084f21f5a9b8b69.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=BD2B2C30-5E51-4DDB-8F7F-509177B886EF&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Dance",
    "raw_showtimes": [
      "Wed 8 Jul at 7:30"
    ]
  },
  {
    "title": "Queen of the Night – A Tribute to Whitney Houston",
    "description": "Queen Of The Night – A Tribute to Whitney Houston returns in 2026 for another show-stopping celebration, following sold-out tours across the UK, including an arena tour and iconic venues such as the Royal Albert Hall and The London Palladium.\n\nEstablished as the UK’s biggest Whitney Houston tribute, this breathtaking production honours the music, legacy, and unmatched talent of the legendary Whitney Houston. Celebrate Whitney’s remarkable musical repertoire in an electrifying production that honours her timeless songs with sensational vocalists and a full live band.\n\nPrepare to be captivated by an extraordinary journey through three decades of all-time hits such as I Wanna Dance With Somebody, One Moment In Time, I’m Every Woman, I Will Always Love You, My Love Is Your Love, So Emotional, Run To You, Saving All My Love, How Will I Know, Million Dollar Bill, The Greatest Love Of All, and many more.\n\nJoin us for an unmissable evening filled with live music, captivating choreography, and powerful vocals, as we pay homage to the one and only queen of the night.\n\nPlease note that this is a tribute production not associated with the Estate of Whitney Houston.",
    "date_start": "2026-07-09T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/507897/CT-1024x432-no-text_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=F40A2AA3-E958-41A1-A6DE-D9A7CD2F1811&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 9 Jul at 7:30"
    ]
  },
  {
    "title": "Yourythmics",
    "description": "A celebration of one of the biggest acts of the 80’s! Taking you on a nostalgic trip back in time to some of the duo’s biggest hits such as ‘Love is a Stranger’, ‘Here Comes the Rain Again’, ‘Would I Lie to You?’, ‘Right by Your Side’ and of course including the number one smash hit ‘Sweet Dreams (Are Made of This)’.\n\nThis is the ultimate, full band experience of the works of the Eurythmics. Energetic musicianship, amazing costumes, audience participation all led by our very own ‘Annie Lennox’- Stacy Green. Not only has Stacy already won the accolade of the UK’s No. 1 Annie Lennox tribute and look alike, voted and awarded by the National Agents Association, but has also been recognised by the UK’s legendary female artist Annie Lennox herself!\n\nThis show will have you dancing in the aisles and singing along to memorable, masterful songs that will take you on a trip down memory lane!",
    "date_start": "2026-07-10T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/562553/Dave-and-Annie-Banner-2500x985-web-image_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=AD41FE52-DAA2-4F78-98BD-408274BAFD8A&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 10 Jul at 7:30"
    ]
  },
  {
    "title": "Rude Science",
    "description": "The naughtiest, funniest, most revolting science show in the world.\n\nBrace yourselves for BBC Gastronaut Stefan Gates’ revolutionary, high-tech, highly-explosive new show, packed with outrageous science stunts. On the surface it’s a riot of disgusting experiments built to delight young audiences but under the bonnet it’s a brilliantly-constructed curriculum-driven adventure designed to inspire Britain’s kids with a lasting fascination for science.\n\nExpect enormous bottoms, f*rt machines, snot cocktails, vast whoopee cushions, pee-powered fireworks and ear-wax-oozing mannequins in this celebration of the fascinating bodily science essential to life. The show transforms complex biology, physics and chemistry into educational hilarity using Stef’s signature stunts and encyclopaedic science knowledge.\n\nStefan Gates is an award-winning presenter of 20 TV series (including five for CBBC including Incredible Edibles, Gastrolab and Gastronuts), and a STEM author of 12 books (including Fartology and Science You Can Eat),and he’s internationally renowned for his clever, high-octane, highly-educational stage shows that inspire young audiences to fall in love with science.",
    "date_start": "2026-07-15T11:30:00+01:00",
    "date_end": "2026-07-16T12:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/537229/1600x600-Website-wide-hero-NO-treatment-02_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=3DB7EC85-18A4-4DE7-A949-3066EE63FF43&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Family",
    "raw_showtimes": [
      "Wed 15 Jul at 11:30",
      "Wed 15 Jul at 3:00",
      "Thu 16 Jul at 11:30"
    ]
  },
  {
    "title": "Stewart Lee vs The Man-Wulf",
    "description": "In this brand new show, Lee shares his stage with a tough-talking werewolf comedian from the dark forests of the subconscious who hates humanity. The Man-Wulf lays down a ferocious comedy challenge to the culturally irrelevant and physically enfeebled Lee. Can the beast inside us all be silenced with the silver bullet of Lee's unprecedentedly critically acclaimed style of stand-up?\n\nStewart Lee (\"The world's greatest living stand-up comedian\" The Times), is in danger of being left behind. He's approaching sixty with debilitating health conditions, his TV profile has diminished, and his once BAFTA award-winning style of stand-up seems obsolete. But can Lee unleash his inner Man-Wulf to position himself alongside comedy legends like Dave Chappelle, Ricky Gervais and Jordan Peterson at the forefront of side-splitting stadium-stuffing sh*t-posting?",
    "date_start": "2026-07-17T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/535819/Stewart-Lee-vs-The-Man-Wulf-2026-Tour-brochure-web-image-landscape-title-treatment_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=4647FDFD-A3CA-410E-BCC7-091D010D55E7&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 17 Jul at 7:30"
    ]
  },
  {
    "title": "K-Pop All Stars",
    "description": "Ride the K-pop wave influencing the World live on stage!\n\nFrom stadium-shaking anthems to breathtaking choreography, K-Pop All Stars celebrates the global phenomenon redefining pop culture. With explosive performances of today’s biggest K-pop hits from BlackPink, NewJeans, Katseye, and BTS and spectacular numbers inspired by the smash-hit film K-pop Demon Hunters, this high-energy tribute brings the thrill of Seoul’s stages to life.\n\nWith a sea of light sticks glowing and the crowd moving as one, you’ll feel the music and the electrifying energy of K-Pop All Stars in this live, immersive experience!",
    "date_start": "2026-07-19T15:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/556531/Kpop-All-Stars-1920x1080-entertainers_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=504E1F61-C2FA-4BA5-965B-78F28B9869F4&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sun 19 Jul at 3:00",
      "Sun 19 Jul at 7:00"
    ]
  },
  {
    "title": "Bowie Experience",
    "description": "Direct from London’s West End, Bowie Experience is a spectacular concert celebrating the sound and vision of David Bowie. A must see for all Bowie fans, the latest production features all the hits from A to Ziggy.\n\nBowie Experience continues to amaze audiences with an astounding attention to detail, bringing the golden years of David Bowie to the stage. So, put on your red shoes and Let’s Dance!",
    "date_start": "2026-07-22T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/540235/BOWIE_1200x628_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=B68025C9-F2E5-41C9-972C-483CD1FFDCAB&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 22 Jul at 7:30"
    ]
  },
  {
    "title": "A Country Night in Nashville",
    "description": "Direct from The Royal Albert Hall, A Country Night In Nashville recreates the scene of a buzzing honky tonk in downtown Nashville, perfectly capturing the energy and atmosphere of an evening in the home of country music.\n\nPrepare to be transported on a musical journey through the history of Country, featuring songs from its biggest stars both past and present. Hits from Johnny Cash to Alan Jackson, Dolly to The Chicks, Willie Nelson to Kacey Musgraves, are showcased by the amazing Dominic Halpin and the Hurricanes.\n\nWith songs including Ring Of Fire,Crazy, Follow Your Arrow, It’s Five O’Clock Somewhere, Need You Now, 9-5, and The Gambler to name just a few, this incredible celebration of country music is a night not to be missed.",
    "date_start": "2026-07-24T19:30:00+01:00",
    "date_end": "2026-07-25T20:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/537233/1920x1080_250909_132340_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=BDC3EEE1-72C2-48A2-A330-7113FA035203&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 24 Jul at 7:30",
      "Sat 25 Jul at 7:30"
    ]
  },
  {
    "title": "THE SIGNATURES NORTHERN SOUL LIVE with special guest Original Northern Soul Artist LORRAINE SILVER",
    "description": "THE SIGNATURES -NORTHERN SOUL LIVE is the only touring Northern Soul show that features an original Northern Soul artist. For this show, you can see LORRAINE SILVER an icon from the legendary Wigan Casino with her classic track 'LOST SUMMER LOVE'\n\nTHE SIGNATURES feature FREDDIE GILMORE one of the hottest young vocalists on the UK Soul scene\n\nTHE SIGNATURES have built up an amazing reputation over the years as the UK’s most authentic Northern Soul Live show . The official backing band for many original Northern Soul Artists from the USA on their UK tours including SIDNEY BARNES, EDDIE HOLMAN & TOBI LEGEND and the late greats DEAN PARRISH & NOLAN PORTER as well as being featured as the house band on The Craig Charles Funk and Soul Show on BBC 6 Music.\n\nImmerse yourself in the energy of a ten-piece live band, showcasing their exceptional talent in their own distinctive style.\n\nExperience the soul-stirring magic, power & expression of The Signatures 10 on stage including 3 horns\n\nThis live show guarantees an evening filled with more than just the Northern Soul classics, presented in a unique and exhilarating manner. Don't miss this opportunity to be part of a soulful journey that takes you back in time and captivates the essence of Northern Soul which is today’s hot genre of music following the massive exposure received by the BBC presenting Northern Soul at The Proms.",
    "date_start": "2026-07-30T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/529333/thumbnail_The-Signatures-FB-EVENTS-Banner_ca828a7e88d497d9ed50aab78d4dc51e.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=CF639812-0CE2-4BC6-B9E9-B4C159CF25BA&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 30 Jul at 7:30"
    ]
  },
  {
    "title": "Roy Orbison and the Traveling Wilburys Experience",
    "description": "Come and enjoy a fantastic evening of entertainment jam-packed with non-stop hits, big-screen action, expert narrative and lots of fun. You will be taken on a journey through several decades of pop as we celebrate the music of Jeff Lynne’s ELO, Roy Orbison, Bob Dylan, Tom Petty & The Heartbreakers and The Beatles’ George Harrison. Also the collective genius that was The Traveling Wilburys.\n\nAlthough the Wilburys never toured, here you have the chance to experience what it might have been like to see them live, as we explore their many collaborative hits.\n\nNow in its 11th year of successful touring, this popular show is an up-tempo feel-good celebration of classics such as Pretty Woman, Mr Blue Sky, Please Please Me, End of The Line, Handle with Care, Free Falling, Blowin in the Wind, Tweeter and the Monkey Man, Heading for the Light, Only the Lonely and many more.",
    "date_start": "2026-08-07T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/560507/Wilbury-Promo2_e3ab5cca73b1c338f3c193b943583328.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=9FCBE5BC-75C8-4498-8166-3C385E659DDB&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 7 Aug at 7:30"
    ]
  },
  {
    "title": "The Tiger Who Came to Tea",
    "description": "A musical play adapted and directed by DAVID WOOD\n\nBased on the book by JUDITH KERR\n\nDirect from the West End, the Olivier Award nominated smash hit show,The Tiger Who Came to Tea returns on tour.\n\nThe doorbell rings just as Sophie and her mummy are sitting down to tea. Who could it possibly be? What they certainly don’t expect to see at the door is a big, stripy tiger!\n\nJoin the tea-guzzling tiger in this delightful family show; packed with oodles of magic, sing-a-long songs and clumsy chaos. Don’t miss this stunning stage adaptation of the classic tale of teatime",
    "date_start": "2026-08-14T11:00:00+01:00",
    "date_end": "2026-08-15T15:00:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567647/Tiger-Stars-1920x1080_d4c194581270bfda190db97077959fb4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=031738BB-46F4-4F9E-81A7-3AE57D2AB58F&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Family",
    "raw_showtimes": [
      "Fri 14 Aug at 11:00",
      "Sat 15 Aug at 11:00",
      "Sat 15 Aug at 2:00"
    ]
  },
  {
    "title": "Gary Faulds: Panic at the Midlife Disco",
    "description": "Join Gary Faulds, the Glaswegian comedian who’s survived every type of life crisis imaginable, in Panic at the Midlife Disco. With his kids getting older and the looming reality of mortality creeping closer, Gary’s having a hilarious meltdown — and you’re invited to the party.\n\nFrom desperate attempts to stay “cool” with his kids to battling a rapidly growing waistline and fading youth, his journey through midlife is anything but elegant.\n\nExpect gut-busting stories, sharp wit and an unfiltered look at the chaos of growing up, getting older and trying to keep it together while everything falls apart.",
    "date_start": "2026-08-15T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/565263/Panic-at-the-Midlife-Disco-Gary-Faulds-Poster_afd1853ac727aaf5a35b1cd350d6e4e4.jpeg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=E2DBAD73-4C1D-45FB-8900-3673AED54716&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 15 Aug at 8:00"
    ]
  },
  {
    "title": "We Will Rock You",
    "description": "Celebrating Freddie Mercury’s last performance with Queen in August 1986, Starlight Musical Theatre bring the sensational ‘We Will Rock You’ for the first time to the stage of Eden Court Theatre in August 2026.\n\n‘We Will Rock You’ you is a high-octane, adrenaline-fuelled musical featuring more than 20 iconic Queen hits, including “Bohemian Rhapsody,” “We Are the Champions,” “Somebody to Love,” “Don’t Stop Me Now,” and of course, “We Will Rock You.”\n\nSet in 300 years in the future, where individuality has been outlawed and music is controlled by algorithms. The story follows two young revolutionaries, Galilio and Scaramouche, who dare to defy the system to save rock ‘n’ roll. To fulfil the prophecy. Galileo must evade the clutches of the Killer Queen and finally bring back the music. With the help of Pop, an aging hippie librarian, Galileo and Scaramouche find Rock's Holy Grail--Brian May's guitar--buried in the remains of Wembley Stadium.\n\nDon’t miss this fist-pumping, foot-stomping anthem to the power of rock!!\n\nLimited number of early bird discounted tickets available. When they’re gone, they’re gone!",
    "date_start": "2026-08-19T19:30:00+01:00",
    "date_end": "2026-08-22T20:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/529663/Edited-Landscape_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=E263F048-8E44-4EB5-9B04-74114EFA4761&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Local / Showcase",
    "raw_showtimes": [
      "Wed 19 Aug at 7:30",
      "Thu 20 Aug at 7:30",
      "Fri 21 Aug at 7:30",
      "Sat 22 Aug at 2:30",
      "Sat 22 Aug at 7:30"
    ]
  },
  {
    "title": "Billy & Tim Widescreen Edition",
    "description": "Football. Theatre. Fireworks. When a Celtic fan and a Rangers fan find themselves locked in a prison cell together on the day of the big match, there’s only one possible outcome — fireworks!\n\nThis explosive, hilarious, and thought-provoking play by Des Dillon returns with a spectacular new twist — Billy & Tim – The Widescreen Edition (Bigger and Better Than Ever).\n\nThe All-Star Commentary Team Old Firm legends David Robertson, Jackie McNamara, Charlie Miller, and Simon Donnelly join broadcasting icons Rob Maclean and David Tanner, delivering full match-style commentary live from the commentary box at every performance. Adding even more energy, TikTok star Hawaii Fivo lends his vocal talents to bring the other prisoners to life with unforgettable character voices.\n\nA Powerful and Timely Story Billy & Tim – The Widescreen Edition isn’t just about football rivalry — it’s a sharp, heartfelt exploration of bigotry, identity, and division. Beneath its laugh-out-loud humour lies a powerful message about sectarianism, prejudice, and the shared humanity that unites us all. From the religious roots of the Celtic–Rangers conflict to reflections on immigration, intolerance, and global unrest, this award-winning play remains as relevant and resonant as ever.\n\n“Singin’ I’m No A Billy, He’s a Tim scores big with a pitch-perfect performance, dribbling between humour and social commentary with finesse.”",
    "date_start": "2026-08-28T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/560511/BillyTim26_Poster_Generic_2500x1500_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=5BEB37F7-BD3F-40BB-B0F1-0D143FFABB87&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Drama",
    "raw_showtimes": [
      "Fri 28 Aug at 7:30"
    ]
  },
  {
    "title": "Chisholm, McGoldrick, O’Connor and Byrne",
    "description": "This outstanding quartet brings together four of the most influential voices in Celtic music.\n\nScottish fiddle virtuoso Duncan Chisholm is renowned for his expressive, cinematic style and award-winning compositions. Duncan’s music, often described as haunting and cinematic, bridges ancient tradition and contemporary creativity.\n\nHe is joined by Michael McGoldrick, widely regarded as the finest Irish flute player of his generation. A founding member of Lúnasa and long-time collaborator with Capercaillie and Mark Knopfler. Michael is recognised internationally for his groundbreaking style and musical versatility.\n\nIrish tenor banjo master Gerry O’Connor adds his unmistakable flair to this line-up. Known worldwide for his inventive playing, acclaimed solo work, and performances with iconic groups from Four Men and a Dog to The Dubliners. Gerry O’Connor is the defining voice of the Irish tenor banjo.\n\nCompleting the ensemble, Dublin guitarist Tony Byrne provides masterful accompaniment to this 4 piece. His rhythmic and soulful playing makes him one of the most in-demand guitarists in contemporary traditional music.",
    "date_start": "2026-08-30T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/570103/Web-image_260107_163503_a19c933270cf4ab49fe3d815631956c6.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=381FD9C1-9420-4002-A535-9917105D78CC&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sun 30 Aug at 7:30"
    ]
  },
  {
    "title": "New Dawn Fades – A Play About Joy Division And Manchester",
    "description": "New Dawn Fades - A Play About Joy Division And Manchester returns with a scintillating new production touring the UK in 2026. The play tells the\n\nstory of four ordinary lads who, inspired by the punk revolution of 1970s Manchester, came together to form one of the most influential bands of all time, Joy Division. Following the untimely death of lead singer Ian Curtis, the band went on to huge world-wide success as New Order\n\nFor 2026, New Dawn Fades reunites the creative team from last year's sell-out tour, with producers NIGEL CARR and TONY DAVIDSON. It is written by the award-winning BRIAN GORMAN, who received much praise for his portrayal of Factory Records boss Tony Wilson. He guides the audience through the heart and soul of both the band and the city, introducing historical figures, including Roman General, Julius Agricola, Dr John Dee, Friedrich Engels, Paul Morley, and Pete Shelley of Buzzcocks! The result is a spellbinding journey of love, passion, grief, and of course music, drawing inspiration from the enigmatic lyrics of Ian Curtis, with a soundtrack featuring iconic hits of the late 1970’s UK music scene, including of course Joy Division. The play is directed by Brian Gorman and Lauren Greenwood, who reprises her role as Debbie Curtis. Josh Lonsdale reprises his role as Joy Division frontman, Ian Curtis.\n\nA smash hit when it debuted at the Greater Manchester Fringe Festival in July 2013, New Dawn Fades has continued to wow audiences across the country, playing to capacity crowds and standing ovations.",
    "date_start": "2026-09-02T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/565245/NDF-Landscape-back_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=6C34FA5D-3D42-49BC-9589-7C1570C5516D&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Drama",
    "raw_showtimes": [
      "Wed 2 Sep at 8:00"
    ]
  },
  {
    "title": "Mànran",
    "description": "Few bands have taken the Scottish music scene by storm quite like Mànran. This multi-award-winning supergroup has spent over fifteen years bringing audiences to their feet from the Highlands to some of the most iconic stages on the planet. Having performed in over 30 countries worldwide, Mànran return to the Highland capital with a show that promises both the exhilarating energy of their celebrated sound and the emotional depth that has made them one of Scotland’s most beloved live acts. A night not to be missed.",
    "date_start": "2026-09-05T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/565257/Photo-12-06-2022-12-18-47_251217_133444_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=A9260607-CB5D-42DA-9B56-2C213810366B&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sat 5 Sep at 7:30"
    ]
  },
  {
    "title": "Banff Mountain Film Festival World Tour",
    "description": "Experience an unforgettable evening of thrilling adventure – up on the big screen!\n\nThe Banff Mountain Film Festival features a brand-new collection of short films filled with extreme journeys, untamed characters and captivating cinematography! Join the world’s top adventure filmmakers and thrill-seekers as they climb, ski, paddle and ride into the wildest corners of the planet!\n\nWith free prize giveaways, this is an unmissable event from the world’s most prestigious mountain festival – guaranteed to spark your passion for adventure, action and travel!\n\nThis is a screening of the 2026 Red Film Programme, announced December 2026. See www.banff-uk.com for more.",
    "date_start": "2026-09-06T19:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/548249/Banff-2026-Tour-Image-1_270a2209a48b862cf63c58918cb2e1eb.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=B31B948A-E038-4AC9-80A2-95A7388A29A5&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Talks / Special Events",
    "raw_showtimes": [
      "Sun 6 Sep at 7:00"
    ]
  },
  {
    "title": "Stuart Mitchell and Friends: On the Road",
    "description": "The one liners have been sharpened, the quick replies are flowing fast and this time - he’s bringing his pals.\n\nFollowing on from his debut sold-out UK Tour join the local lad with over 100M views on TikTok, star of social media, Radio 4 funny man and 8 tipped wonder STUART MITCHELL as he brings his famous weekly STUART MITCHELL & FRIENDS show direct from Glasgow to your front door (nearly).\n\nFeaturing TWO SPECIAL GUESTS from the cream of the comedy crop, don’t miss out on a night that’ll have you laughing into your chips and cheese all the way home.",
    "date_start": "2026-09-09T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/553579/SMFOTR-holder-1920x1080_bcc29d587bb7722fb9d93d5f00dac88e.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=9AC07B8C-2139-4374-93ED-7A66B56596C0&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Wed 9 Sep at 7:30"
    ]
  },
  {
    "title": "Endless Love The Show – A Tribute to Diana Ross and Lionel Richie",
    "description": "Become an Eden Court Friends member to book your tickets from Thu 30 Oct, 10am. Find out more and sign up by clicking here.\n\nGeneral tickets will be released from Fri 31 Oct, 10am.\n\nStep into a night of show-stopping vocals, dazzling performances, and a sensational live band in Endless Love The Show- the ultimate celebration of Diana Ross and Lionel Richie.\n\nBrimming with iconic hits and timeless classics, this spectacular show features chart-toppers including I’m Coming Out, Dancing on the Ceiling, Upside Down, Say You Say Me, Chain Reaction, All Night Long, Ain’t No Mountain High Enough, Hello, You Can’t Hurry Love and, of course, the No. 1 duet of all time, Endless Love, plus many more!\n\nWith authentic arrangements inspired by Lionel’s and Diana’s original touring productions, Endless Love is a thrilling, joy-filled journey through some of popular music’s greatest hits. This show will have you singing, dancing, and reminiscing from start to finish.\n\nA truly dazzling production that captures the glamour, emotion, and energy of these two musical icons together for the first time in one unique show. From the magical Motown era, irresistible 80s & 90s anthems, and infectious dance floor hits - Endless Love has it all.\n\nYou already know every word - so warm up those vocals, put on your dancing shoes, and get ready to party… All Night Long!",
    "date_start": "2026-09-10T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/553559/1098x628_IMAGEONLY_EndlessLove_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=C1E85D67-CFC4-42ED-ACB6-99925DC31A5D&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 10 Sep at 7:30"
    ]
  },
  {
    "title": "Susan Calman: Tall Tales",
    "description": "Susan Calman hasn’t been on tour in ten years, but now she’s back with a brand-new show. A decade older, but not necessarily wiser, Susan has found herself in some improbable situations over the years. Tall tales is a show about Cruising, driving tanks, cats and getting older. You might have seen her on the television or heard her on the radio but the absolute best way to see her is live on stage. You won’t believe how short she really is. Prepare yourself for an evening of barely believable stories, laughter and probably some dancing.As seen on Grand Day Out, Cruising with Susan Calman, QI, House of Games and (a long time ago) Strictly Come Dancing.",
    "date_start": "2026-09-11T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/560515/Susan-Calman-blank-2026-1920x1080_8822ca6afe4d853ef9f7a38926c23c22.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=FD311AB3-A5BF-421F-8F16-1FBF0D259C5E&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 11 Sep at 7:30"
    ]
  },
  {
    "title": "Irvine Welsh's PORNO",
    "description": "Stage adaptation of the follow up novel to TRAINSPOTTING. Set 20 years after TRAINSPOTTING, what has become of RENTON, SICKBOY, SPUD & BEGBIE?\n\nContains swearing, drug use, language of a sexual nature and hysterical shenanigans. As if you’d expect anything else!\n\nAdapted by Davie Carswell, writer of The TOMMY BURNS Story and Glasgow Kiss.\n\nPORNO started out as a fifty minute one act, with a sold out run at the Pleasance as part of the Edinburgh Fringe ’22.\n\nThe two hour full length version has since had two sold out runs at the Glasgow King’s, before going on to a UK wide tour, culminating in a 7 week sold out run at the Art’s Theatre in LONDON’s WEST END where it was nominated as BEST NEW PLAY in the What’s On Stage Awards.",
    "date_start": "2026-09-12T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/553583/PORNO_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=9BEA1FBE-41B9-4BBD-8AE1-88E7145D6A01&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Drama",
    "raw_showtimes": [
      "Sat 12 Sep at 7:30"
    ]
  },
  {
    "title": "Nathan Carter and his Band Live 2026",
    "description": "Over the last 10 years, Irish entertainer Nathan Carter has become one of the UK’s most prolific touring artists, performing over 300 concerts with his incredible band bringing back old fashioned musicianship that has become his signature trademark.\n\nBorn in Liverpool to Irish parents from County Down, Nathan Carter has released 9 studio albums and 4 live albums. He performs pop, Irish folk, country music and timeless ballads… he is truly a great entertainer!\n\nWith tracks such as ‘Wagon Wheel’ and ‘I Wanna Dance’ receiving hit status, he is one of Ireland’s biggest artists, who has outsold One Direction, Pharrell Williams and Michael Buble. He also became the first Irish country act to reach number 1 in the Irish charts in 2013 after Garth Brooks, six years before.\n\nGrowing up in a house where Country and Western music filled the air, Nathan was exposed to the classic songs of Johnny Cash, Don Williams and Dolly Parton which firmly rooted themselves in his musical DNA.\n\nFrom the tender age of 4 years old, not only learning to play guitar, piano and accordion, which plays a vital part in his live show, Nathan quickly became head chorister in the Liverpool Boys choir where he toured the world… and even performed in front of the Pope in Rome!\n\nNathan and his band are now coming to perform at a concert venue near you... don't miss this fantastic show!",
    "date_start": "2026-09-16T19:30:00+01:00",
    "date_end": "2026-09-19T20:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/535811/Nathan-Carter_250902_110540_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=B54EB178-735D-442B-B237-66C62762FA21&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Wed 16 Sep at 7:30",
      "Thu 17 Sep at 7:30",
      "Fri 18 Sep at 7:30",
      "Sat 19 Sep at 7:30"
    ]
  },
  {
    "title": "Budapest Café Orchestra",
    "description": "CHRISTIAN GARRICK – violin, darbuka\n\nMARCUS TILT – accordion\n\nKELLY CANTLON – double bass\n\nADRIAN ZOLOTUHIN – guitar, saz, balalaika, domra\n\nIn 2009 Christian Garrick established the refreshingly unconventional and snappily attired Budapest Café Orchestra with the intention to present a broad range of music from all over the world in the most entertaining and fun way. BCO perform all their music from memory. Combined their trademark wit and charm, audiences are left tingling with warmth, delight and amazement.\n\nBCO are one of the very busiest acoustic groups for me today playing an average of 75 shows per annum. Since their inception they have recorded one album every year and in January 2025 made their 16th waxing Goulash Supernova. BCO are frequent guests to BBC Radio 3’s In Tune.\n\nEach member of the orchestra is a freelance musician in their own right. Adrian teaches school-age musicians of all standards and is curator of the fabled Imperial Balalaika Orchestra of Overton. Christian is a professor of jazz violin at Guildhall School of Music, Royal Academy of Music, and Royal College of Music in London. Marcus is one of UK’s most in-demand accordionistas often found playing at many a West End show in his spare time. Kelly is a veteran bassist who was once a Vagabond of Northern Soul icons Jimmy James & The Vagabonds.\n\nFrom a musical family with jazz and classical learnings Christian Garrick is musical director of BCO and his influences run far and wide. He first discovered Hungarian and Romanian folk and gypsy music listening to Sandor Lakatos and Taraf du Haidouks. Christian’s arrangements for BCO of Rachmaninoff, Tchaikovsky and Greig - the so called ‘squeezebox concertos’ - are rooted in BCO folklore. His arrangements of traditional Gaelic tunes on the album The Gaelic Chronicles was met with critical acclaim with the likes of Cerys Matthews and Mark Radcliffe both championing the disc on their respective radio shows. Christian is influenced by a range of fiddlers from Grappelli to Stuff Smith to Indian virtuosos L Shankar and L Subramaniam. Nigel Kennedy, a sometimes collaborator with Christian on stage, described him as “one of my favourite violinists”. Christian’s own unique hybrid playing style, sheer emotional passion and extraordinary improvisational abilities thrills audiences everywhere.",
    "date_start": "2026-09-18T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567661/Budapest-Cafe-Orchestra_baccbf3c8fa32a6de2dbe88f6cb97361.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=BC6CB92C-4000-4902-B9DC-F129D9EC64AE&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 18 Sep at 8:00"
    ]
  },
  {
    "title": "ATTENTION ALL SHIPPING A Celebration of the Shipping Forecast With Charlie Connelly",
    "description": "As the shipping forecast embarks on its second century, Charlie Connelly’s hilarious and informative show brings the quirky broadcast vividly to life, celebrating what he firmly believes to be the greatest invention of the modern age.\n\nHow did a weather forecast for mariners capture the hearts of a nation, from salty old sea dog to insomniac landlubber? How is it possible for ‘rain later’ to be ‘good’? And where the hell is North Utsire?\n\nDelving into the history of the forecast and the extraordinary people who made it, Charlie explains what all those curious phrases really mean, celebrates its wide cultural impact, shares riproaring adventures from his own extraordinary journey through the 31 sea areas and presents his case for the shipping forecast being our finest achievement.\n\nInspired by Charlie’s bestselling book, which has sold more than a quarter-of-a-million copies, this pacy, moving and hilarious show is selling out theatres up and down the land as it takes you all the way from Viking to South-East Iceland. Attention All Shipping guarantees the shipping forecast will never sound the same again.",
    "date_start": "2026-09-19T19:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/556571/CC2_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=939DD076-6FF7-4791-9779-A7BFBAB29C1A&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Sat 19 Sep at 7:00"
    ]
  },
  {
    "title": "The Illegal Eagles – Hotel California Tour",
    "description": "In 2026, the Illegal Eagles celebrate an incredible 30 years on the road with their brand-new Hotel California Tour.\n\nRenowned for their flawless vocals, stunning guitars, and an uncanny ability to recreate the legendary sound of the Eagles, the Illegal Eagles have earned a reputation as one of the most accomplished and popular live acts in the UK.\n\nThis milestone tour will feature a full performance of the iconic Hotel California album, played in its entirety — including classics like Life in the Fast Lane, New Kid in Town, and, of course, the unforgettable title track.\n\nAlongside this, audiences can expect a set packed with all the greatest hits from across the Eagles’ timeless back catalogue.\n\nWith decades of experience, outstanding musicianship, and a deep love for the music they perform, the Illegal Eagles promise an unforgettable evening of nostalgia and pure musical magic that continues to captivate fans old and new.",
    "date_start": "2026-09-21T19:30:00+01:00",
    "date_end": "2026-09-22T20:30:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/556589/IE26_1920x650_7a705e504281aa9fdccb6cbbedeede61.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=D2A6FD46-65C8-492C-B561-673A23C17724&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Mon 21 Sep at 7:30",
      "Tue 22 Sep at 7:30"
    ]
  },
  {
    "title": "Derek Ryan Live In Concert",
    "description": "Derek Ryan remains firmly established as one of the most gifted and enduring singer-songwriters in Irish country music. Renowned for his catchy lyrics, infectious melodies, and captivating stage presence,\n\nWith a new concert tour for 2026, Derek continues to delight fans with his remarkable ability to release fresh, original music while also celebrating the timeless hits from his extensive back catalogue.\n\nHis concerts combine high energy with true audience connection, offering a setlist that spans cherished classics and his latest hits.\n\nFrom packed theatres to major festival stages, Derek Ryan’s performances showcase not just his musical talent, but also his dedication to crafting songs that resonate across generations.\n\nWith a career defined by creativity, consistency, and a genuine bond with his audience, Derek’s 2026 tour promises to be another milestone in an already outstanding journey in Irish country music.\n\nPresented by Rising PR",
    "date_start": "2026-09-25T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/562697/Derek-Ryan-Web-Image_afd1853ac727aaf5a35b1cd350d6e4e4.png",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=73713197-7D56-4C39-AF54-16298694C7B1&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Fri 25 Sep at 7:30"
    ]
  },
  {
    "title": "Fred MacAulay - Good Evening!",
    "description": "For reasons outwith his control, Fred had to cancel his 2025 Edinburgh Fringe shows and his Autumn Tour - “Fred MacAulay: No podcast - LIVE”. Now, thankfully, due to reasons completely within his control, he is now preparing to hit the road in 2026 with the 2025 show repackaged and updated and simply called “GOOD EVENING!”.\n\nSo what happened? Simply put: Fred suffered a freak accident and then an unrelated prostate cancer diagnosis. Is there humour in either of these? In the words of a famous Scotland footballer “Maybes Aye, Maybes Naw”.\n\nNow in the fourth decade of his comedy career, Fred MacAulay still loves being on stage doing what he does best ...... quite simply it's STAND-UP and his appetite for performing is as strong as it was all those years ago when he took a massive side-ways step from a career as an Accountant and Company Secretary into the world of entertainment.\n\nA career which has taken him all over the world (apart from South America) (and some other continents) where he has worked in television and radio. But it’s always been and always will be as a stand-up that Fred wants to be remembered. It's because of stand-up that he’s been asked to do all the 'celebrity' things that he’s done.\n\nHe might talk about some of them, but he's more likely to talk about what is current - having been a guest on the famous Radio 4 News Quiz show for almost 18 years he has some previous in this respect. And as a family man he'll no doubt be talking about the latest stage of that aspect of life ..... grandchildren. \"I can remember the joy of having our kids just after I'd embarked on my career in comedy ..... what a great source of material they were! I mean, that wasn't the main reason for having kids ...... but I hope the same applies to the grandkids!\"\n\nFred hates the word ‘celebrity’ yet he’s done Celebrity Mastermind (twice) and Celebrity Masterchef (once) and who can forget his Celebrity Fame Academy for Comic Relief (Answer: hopefully everyone). Asked twice to do ‘I’m A Celebrity Get Me Out Of Here’ Fred said No! “I’m waiting for the Scottish version ….. “So You Think You’re A Celebrity, Get The **** Out Of Here!”\n\nAsked for a snappy quote for publicity, Fred sent this: “I really hope that a lot of people come out to see this tour. I think it’s the best show I’ve done since the last one.”",
    "date_start": "2026-09-25T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/562743/Fred-MacAulay-Andrew-Cawley_aa314bb36a2b40afc7dad0471637376b.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=23FDC5E2-C61F-4988-9751-B86BDFF01066&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 25 Sep at 8:00"
    ]
  },
  {
    "title": "UK Pink Floyd Experience",
    "description": "Lose yourself in ‘The Songs from every Album Tour’in 2026!\n\nFeaturing songs from every one of Pink Floyd’s 15 studio album legacy.\n\nWith extraordinary accuracy and a stunning light show - you’ll hear the songs you love, no matter which era of Pink Floyd you prefer.\n\nPerformed by top-flight musicians the UK Pink Floyd Experience is two hours of incredible music and a faithful celebration of the UK’s most visionary rock band.\n\nOf course, all the usual suspects will be there: Money, Time, The Great Gig in the Sky, Another Brick in the Wall and of course Comfortably Numb.\n\nBut also, be prepared to hear songs from the \"Syd\" and psychedelic period, right through to extracts from The Endless River.\n\nJoin us as we bring the authentic feel of a Pink Floyd show to life in a spectacular concert you won’t want to miss.",
    "date_start": "2026-09-26T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/545943/UKPF-23-fbevent-1920x1080_251007_114756_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=9A1E280A-FF02-47EE-A5D6-A17877E5C609&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Sat 26 Sep at 7:30"
    ]
  },
  {
    "title": "The Sound of Springsteen",
    "description": "Experience the pure rock 'n' roll euphoria of Bruce Springsteen as this outstanding show brings his iconic sound to life, taking you on a musical journey through the incredible catalogue, from Greetings from Asbury Park to 2020's Ghosts via the legendary hits Born in the USA and Born to Run.\n\nFrom high-octane vocals to the phenomenal stage production, every detail is meticulously crafted to transport you back to the golden age of rock 'n' roll. Whether you’re a lifetime Springsteen fan or discovering his music for the first time, you will be captivated by the thundering guitars, iconic saxophone and powerful lyrics that defined generations.\n\nGet ready to experience the legacy of The Boss and rock the night away with the authentic Springsteen experience!",
    "date_start": "2026-09-29T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567415/Sound-of-Springsteen-2025_777cc5e826f74807e4f86846bdefdbb9.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=63D6BA61-5DDB-40AC-A347-ED59D00216BB&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Tue 29 Sep at 7:30"
    ]
  },
  {
    "title": "LAURA LEXX: YO-YO",
    "description": "In a 10-year marriage eventually your partner sees it all. Every bad idea. Every silly decision. Every unfiltered thought, and somehow, they still say they love you.\n\nThe real twist is that somewhere along the way, you have to believe them. And maybe, just maybe... you learn to love yourself too.\n\nFresh off the success of her critically acclaimed show Slinky, multi award-winning comedy star Laura Lexx is back with her brand new show Yo-Yo.",
    "date_start": "2026-10-02T20:00:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/538223/Laura-Lexx-2025_c60b25c9c875674441085b76a4cf8a30.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=DE090EF6-9E60-460F-B41C-5E9F917DD99E&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Comedy",
    "raw_showtimes": [
      "Fri 2 Oct at 8:00"
    ]
  },
  {
    "title": "SIX",
    "description": "DIVORCED ★ BEHEADED ★ LIVE!\n\nThe crowning glory of Broadway, the West End and beyond, the international smash hit musical SIX makes its royal return to Inverness following its previous sell out success!\n\nWinner of over 35 international awards including the Tony Award for ‘Best Original Score’ and ‘Best Costume Design’, double winner of the Whatsonstage Award for ‘Best West End Show’ and a Gold-Disk winning album, this sell-out Tudor take-off has ‘an incredibly strong and powerful message’ (The Australian) and is ‘pure entertainment’ (New York Times). From Tudor Queens to Pop Princesses, the six wives of Henry VIII take to the mic to tell their tales, remixing five hundred years of historical heartbreak into an 80-minute celebration of 21st century girl power. These Queens may have green sleeves but their lipstick is rebellious red.\n\nThink you know the rhyme, think again...\n\nDivorced. Beheaded. LIVE!\n\nCaptions- Live text of the spoken word and sound effects on stage.",
    "date_start": "2026-10-06T20:00:00+01:00",
    "date_end": "2026-10-10T21:00:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/562607/SIXT25158_2500x985pxls_INVERNESS-WEBPAGE_afd1853ac727aaf5a35b1cd350d6e4e4.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=046B4EA7-F500-46B0-BB85-EE5CB42B3AF2&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Musicals",
    "raw_showtimes": [
      "Tue 6 Oct at 8:00",
      "Wed 7 Oct at 6:00",
      "Wed 7 Oct at 8:30",
      "Thu 8 Oct at 8:00",
      "Fri 9 Oct at 6:00",
      "Fri 9 Oct at 8:30",
      "Sat 10 Oct at 4:00",
      "Sat 10 Oct at 8:00"
    ]
  },
  {
    "title": "Grease",
    "description": "Ness Entertainment is delighted to bring the electrifyin’ musical Grease to the Highlands, following the success of their productions of Annie and Joseph and the Amazing Technicolor Dreamcoat.Get ready for another unforgettable theatrical experience as the ultimate feel-good musical comes to the stage at Eden Court.Bursting with iconic songs like Summer Nights, Greased Lightnin’, Hopelessly Devoted to You and You’re the One That I Want, this high-energy, feel-good show is the perfect night out.So slick back your hair, grab your leather jacket, and join us at Rydell High in October 2026!\n\nBook for Friday 16th October for our special sing a long performance!",
    "date_start": "2026-10-15T19:30:00+01:00",
    "date_end": "2026-10-18T14:00:00+01:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/545125/Grease-ECT-Cover-Image_afd1853ac727aaf5a35b1cd350d6e4e4.jpeg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=7613228A-E5FD-498C-91D3-D025E3F7F605&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Musicals",
    "raw_showtimes": [
      "Thu 15 Oct at 7:30",
      "Fri 16 Oct at 8:30",
      "Sat 17 Oct at 2:30",
      "Sat 17 Oct at 7:30",
      "Sun 18 Oct at 1:00"
    ]
  },
  {
    "title": "Hue and Cry",
    "description": "Become an Eden Court Friend to book your tickets from Wed 22 Oct, 10am. General sale opens Fri 24 Oct, 10am.\n\n80s icons Hue and Cry have announced a series of Scottish dates as part of their UK tour for 2026, with special guests Roachford & Johnny Hates Jazz on selected dates. Bringing a special show featuring full sets and full bands to Inverness, Aberdeen, Edinburgh, Glasgow & Perth next October.\n\nBrothers Patrick and Gregory Kane formed Hue and Cry in 1984 and the duo made a huge impact with the release of their debut album ‘Seduced and Abandoned’ (1987) which featured their first top ten single ‘Labour of Love’. The follow up album ‘Remote’ continued the trend and produced the huge hits ‘Looking for Linda’ & ‘Violently’. Albums like ‘Stars Crash Down’, ‘Showtime’ and ‘Jazz Not Jazz’ ensured Hue and Cry’s continued successful run through the 90’s, whilst their 2005 appearances as finalists on ITV’s primetime show ‘Hit Me Baby One More Time’, featuring their version of Beyonce’s ‘Crazy In Love’, thrust the band firmly back into the mainstream limelight.\n\nHue and Cry have sold more than two million records worldwide, released 15 studio albums and performed alongside some of the greatest artists in music history - appearing with U2, James Brown, Madonna, Al Green and Van Morrison.\n\nThe brothers will be honoured with the Outstanding Achievement Award at the 2025 Scottish Music Awards in recognition of their career spanning across four decades.\n\nOn next year’s tour, Pat Kane says:\n\n“It’s always the most exciting thing to be playing live with the full Hue And Cry band, we can give all the hits - and audience favourites - the full widescreen treatment. It’s also an honour to be playing these gigs with icons of the era as Roachford and Johnny Hates Jazz. Come and see us - looking as sharp as you like - and let’s elegantly party together.”\n\nGreg Kane adds:\n\n“We’re delighted to be taking the full band on the road again following the recent success of our 40th Anniversary tour. The venues included on this run of dates are bigger and some of the best in the country, we cannot wait to play them.”\n\nRoachford has become one of the most compelling and consistent rock and soul artists the UK has produced, since ‘Cuddly Toy’ reached Number 4 in the charts in 1988. He has released 10 studio albums and several greatest hits collections, been sought-after as a songwriter by the likes of Michael Jackson, Joss Stone and Chaka Khan, and consistently toured on his own and with contemporaries including Terence Trent D’Arby and The Christians.\n\nFor the past nine years, he has been part of Mike + the Mechanics, recording with Mike Rutherford’s post-Genesis band and playing live with them across the world. In 2019, Roachford received an MBE for Services to Music.\n\nBest known for a cycle of hits in the late 1980s, Johnny Hates Jazz consists of Clark Datchler & Mike Nocito. The pair gained notoriety with their hit singles ‘Shattered Dreams’, ‘I Don’t Want To Be A Hero & ‘Heart Of Gold’’ in the late1980s which later followed with the release of the band’s first album ‘Turn Back The Clock’, reaching a number one chart position in 1988.\n\nThe band parted ways at the height of their success - later reuniting in 2010, to write and record their most recent albums ‘Magnetised’, ‘Release You’ & ‘Wide Awake’ amongst which, Datchler & Nocito have been performing across the country.",
    "date_start": "2026-10-22T19:30:00+01:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/552695/Hue-and-Cry_57c7e3546daab2800f27fa9a2af9b95b.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=9159DE78-879F-4E4F-BC9D-904F29626B10&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 22 Oct at 7:30"
    ]
  },
  {
    "title": "Claudia Buckley: The Galway Girl",
    "description": "After a sell out tour in 2025, The Galway Girl returns to England and Scotland with her brand new show this Autumn.\n\nFresh off winning 'Female Entertainer of the Year' and previously voted Female vocalist of the year at the Irish Country Music Awards, Claudia Buckley is bringing her brand new production on her biggest tour to date. With multiple No1 country hits and her self-penned single 'Honey Bee' breaking into the Irish pop charts, Claudia’s unique blend of traditional country has captured hearts everywhere with a show not to be missed.\n\nGalway-based and steeped in country music, Claudia has toured across Ireland, the UK, and beyond. Now, with her second studio album out, she’s ready to perform many of her hits, alongside her Special guests on the night.\n\nDon’t miss this unforgettable tour!",
    "date_start": "2026-11-19T19:30:00+00:00",
    "date_end": null,
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/567419/Claudia-Buckley-Tour-2026-The-Galway-Girl-IMAGE-1_9e0faef3c8ea0faac496450b73bfdd67.jpeg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=7007D6CF-6C18-470E-9D3B-543503588CC3&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Music",
    "raw_showtimes": [
      "Thu 19 Nov at 7:30"
    ]
  },
  {
    "title": "Cinderella",
    "description": "Join us at Eden Court for the spectacular family panto Cinderella – back with all the magic, music and mayhem you’ve come to know and love!\n\nPoor Cinderella toils night and day, dreaming of a very different life. When a royal invitation arrives, it seems her wish for a brighter future might finally come true. But will her Wicked Stepsisters spoil her chance at happiness? Or can her Fairy Godmother – with a little help from the ever-cheerful Buttons – work their magic in time?\n\nEveryone’s favourite rags to riches tale will be full of all of the ingredients you love from the Eden Court panto: side-splitting slapstick, dazzling musical numbers and plenty of audience participation for the whole family.\n\nThe clock is ticking… so dust off your glad-rags and book your tickets today for this magical festive treat!\n\nSchool Groups\n\nPupil tickets £15 / 1 free adult ticket per 10 pupil tickets\n\nPlease contact Ticket Sales on 01463 234 234 or [email protected]\n\nMain Sponsor\n\nSigned- British Sign Language interpretation of the spoken and artistic content.\n\nCaptions- Live text of the spoken word and sound effects on stage.\n\nTouch Tour - They are behind the scenes tours in order for visually impaired patrons to walk on the set, feel costumes and props, and get an account of where these things appear in the show, and their relevance to the story. Tours are free of charge but are specifically for visually impaired patrons and their companions.\n\nRelaxed - We make the following changes to the space to hopefully make more customers feel comfortable attending: house lights on, volume lower, freedom to move around, electronic devices permitted, visual story where possible. Find out more",
    "date_start": "2026-12-02T19:00:00+00:00",
    "date_end": "2027-01-03T17:00:00+00:00",
    "image_url": "https://d1k3q0ugxih2r.cloudfront.net/_imager/files/562049/Cinderella-Title-A4-2020-Mix-Purple_8329634f944132f82f9f94ee3ceffd37.jpg",
    "ticket_url": "https://tickets.eden-court.co.uk/Online/mapSelect.asp?doWork::WSmap::loadMap=Load&createBO::WSmap=1&BOparam::WSmap::loadMap::performance_ids=95C02A83-79D1-412C-A43E-0CD17E1B4A7F&returnTo",
    "price_display": "Check site",
    "min_price": 0.0,
    "age_restriction": "All Ages",
    "min_age": 0,
    "venue_name": "Eden Court",
    "category_name": "Family",
    "raw_showtimes": [
      "Wed 2 Dec at 7:00",
      "Thu 3 Dec at 1:30",
      "Thu 3 Dec at 7:00",
      "Fri 4 Dec at 1:30",
      "Fri 4 Dec at 7:00",
      "Sat 5 Dec at 1:00",
      "Sat 5 Dec at 5:00",
      "Sun 6 Dec at 1:00",
      "Sun 6 Dec at 5:00",
      "Wed 9 Dec at 1:30",
      "Wed 9 Dec at 7:00",
      "Thu 10 Dec at 11:00",
      "Thu 10 Dec at 7:00",
      "Fri 11 Dec at 11:00",
      "Fri 11 Dec at 7:00",
      "Sat 12 Dec at 12:00",
      "Sat 12 Dec at 1:00",
      "Sat 12 Dec at 5:00",
      "Sun 13 Dec at 1:00",
      "Sun 13 Dec at 5:00",
      "Tue 15 Dec at 1:30",
      "Tue 15 Dec at 7:00",
      "Wed 16 Dec at 1:30",
      "Wed 16 Dec at 7:00",
      "Thu 17 Dec at 1:30",
      "Thu 17 Dec at 7:00",
      "Fri 18 Dec at 1:30",
      "Fri 18 Dec at 7:00",
      "Sat 19 Dec at 1:00",
      "Sat 19 Dec at 5:00",
      "Sun 20 Dec at 1:00",
      "Sun 20 Dec at 5:00",
      "Tue 22 Dec at 1:30",
      "Tue 22 Dec at 7:00",
      "Wed 23 Dec at 1:00",
      "Wed 23 Dec at 5:00",
      "Thu 24 Dec at 1:00",
      "Thu 24 Dec at 5:00",
      "Sat 26 Dec at 2:30",
      "Sat 26 Dec at 7:00",
      "Sun 27 Dec at 1:00",
      "Sun 27 Dec at 5:00",
      "Mon 28 Dec at 2:30",
      "Mon 28 Dec at 7:00",
      "Tue 29 Dec at 2:30",
      "Tue 29 Dec at 7:00",
      "Wed 30 Dec at 1:00",
      "Wed 30 Dec at 5:00",
      "Thu 31 Dec at 1:00",
      "Thu 31 Dec at 5:00",
      "Sat 2 Jan 2027 at 2:30",
      "Sat 2 Jan 2027 at 7:00",
      "Sun 3 Jan 2027 at 1:00",
      "Sun 3 Jan 2027 at 5:00"
    ]
  }
]